[
	{
		"Name": "American",
		"PicturePath": "culture_pictures/american.png",
		"NationalityWeights": {
			"USA" : 300,
			"Russia" : 10,
			"Great Britain" : 4,
			"Israel" : 4,
			"Germany" : 3,
			"Italy" : 3,
			"Norway" : 3,
			"Sweden" : 3,		
			"Austria" : 2,
			"Denmark" : 2,
			"France" : 2,
			"Iceland" : 2,
			"Ireland" : 2,
			"Netherlands" : 2,
			"Poland" : 2,
			"Swiss" : 2,		
			"Estonia" : 1,
			"Finland" : 1,
			"Kazakhstan" : 1,
			"Arabia" : 1,
			"Bosnia and Herzegovina" : 1,
			"Turkey" : 1,
			"Portugal" : 1,
			"Greece" : 1,
			"Macedonia" : 1,
			"Spain" : 1,
			"Romania" : 1,
			"Lithuania" : 1,
			"Kosovo" : 1,
			"Albania" : 1,
			"Azerbaijan" : 1,
			"Moldova" : 1,
			"Slovakia" : 1,
			"Luxembourg" : 1,
			"Hungary" : 1,
			"Korea" : 1,
			"Latvia" : 1,
			"Belgium" : 1,
			"Japan" : 1,
			"Montenegro" : 1,
			"Armenia" : 1,
			"China" : 1,
			"India" : 1,
			"Georgia" : 1,
			"Belarus" : 1,
			"Bulgaria" : 1,
			"Malta" : 1,
			"Serbia" : 1,
			"Slovenia" : 1,
			"Ukraine" : 1,
			"Czechia" : 1,
			"Vietnam" : 1,
			"Croatia" : 1
		},
		"SkinColorTypeWeights": {
			"Real" : 10,
			"Fair" : 10,
			"Dark" : 5,
			"Caucasian" : 10,
			"Indian" : 5,
			"BeautifulTouch" : 15,
			"Ebony" : 5,
			"NormalAndTan" : 10,
			"Natural" : 15,
			"Asian" : 10,
			"Black" : 5,
			"Kerbal" : 0
		},
		"SuitColor1": {
            "r": 150,
            "g": 150,
            "b": 150,
            "a": 255
		},
		"SuitColor2": {
            "r": 0,
            "g": 30,
            "b": 130,
            "a": 255
		},
		"Biographies": [
			"Commander <firstname> <lastname> is an astronaut whose distinguished career has centered on lunar exploration as part of American space missions. With a background in geology and planetary science, they've conducted extensive research on the Moon's surface, contributing crucial insights into lunar geology. <lastname>'s expertise in lunar studies has made them a respected figure in the field, operating under the banner of American-led space exploration efforts. They are also an advocate for international collaboration in space endeavors, fostering unity among nations while representing the USA's commitment to exploration.",
			"Astronaut <firstname> <lastname> is a space scientist known for their groundbreaking research in astrobiology and planetary science, working within the American space program. Their contributions to the study of extremophiles and the potential for life beyond Earth have reshaped our understanding of the cosmos. <lastname> actively engages with the public, sharing the excitement of astrobiology while representing the USA's commitment to space exploration. They inspire the next generation of scientists and explorers to venture into the mysteries of the universe, proudly carrying the American flag in their cosmic pursuits.",
			"Captain <firstname> <lastname> is an astronaut whose visionary leadership has propelled American efforts to establish a sustainable presence on Mars. Their pioneering missions aim to conduct experiments and create life-support systems on the Red Planet, showcasing the USA's commitment to pushing the boundaries of space exploration. <lastname>'s exceptional leadership and innovative approach to Martian settlement have earned them recognition as a leading figure in space architecture and engineering, firmly rooted in American space programs. They advocate for responsible space exploration practices while representing the USA's pioneering spirit.",
			"Commander <firstname> <lastname>, an astronaut known for their unwavering commitment to space sustainability, operating as part of the American space program. With a background in environmental science and engineering, they've worked tirelessly to develop sustainable space habitats and life-support systems under the auspices of American space initiatives. <lastname>'s dedication to responsible space exploration practices aligns with the USA's commitment to protecting the celestial environment and preserving the cosmos for future generations. They actively engage with space agencies and organizations worldwide while proudly representing the USA in our cosmic endeavors.",
			"Astronaut <firstname> <lastname> is a space scientist whose pioneering research in planetary geology and exploration is carried out in collaboration with American space missions. Their groundbreaking missions to study the geology of asteroids and moons have provided valuable insights into the history of our solar system, underscoring America's leadership in planetary science. <lastname>'s dedication to unraveling the mysteries of these distant worlds has positioned them as a prominent figure in space exploration, firmly rooted in the American tradition of pushing the boundaries of knowledge and discovery. They are also a passionate advocate for science education, inspiring the next generation of space scientists while proudly representing the USA on the cosmic stage.",
			"Astronaut <firstname> <lastname> is a space scientist renowned for their expertise in astrobiology and planetary exploration, working diligently within American space programs. Their groundbreaking research on the potential for life beyond Earth has captivated the scientific community. <lastname> is not only a scientist-astronaut but also a talented musician, blending their passion for music and science to inspire others. Their mission is to make the wonders of space accessible to all, using their talents to bridge the gap between the cosmos and Earth, while proudly representing the USA's commitment to space exploration.",
			"Captain <firstname> <lastname> is an astronaut whose extraordinary leadership has been instrumental in shaping the USA's space exploration efforts. With a background in aerospace engineering, they've spearheaded the development of innovative spacecraft technologies that will power future missions. <lastname> is also an accomplished author, using their writing to convey the awe and wonder of space to a broader audience. Their works inspire a new generation of space enthusiasts and reflect the USA's unwavering dedication to pioneering discoveries beyond our planet's boundaries.",
			"Commander <firstname> <lastname> is an astronaut who has dedicated their career to unraveling the mysteries of the cosmos. Their missions, conducted under the banner of American space programs, have taken them to the far reaches of our solar system. <lastname> is known not only for their scientific prowess but also for their artistic talents, capturing the beauty of space through stunning visual art. Their art serves as a reminder of the USA's commitment to exploring the celestial unknown while adding a unique dimension to the world of space exploration.",
			"Astronaut <firstname> <lastname>, a visionary explorer who operates as part of American space missions, contributing to cutting-edge research on space habitats and colonization. They are also a dedicated advocate for sustainable living, both on and off Earth, emphasizing the importance of ecological responsibility in our cosmic endeavors. <lastname> actively engages with communities, inspiring them to embrace eco-friendly practices while representing the USA's commitment to advancing not only space exploration but also the preservation of our home planet.",
			"Commander <firstname> <lastname> is an astronaut known for their multifaceted contributions to American space programs. With a background in robotics, they've played a pivotal role in developing autonomous systems for exploring distant celestial bodies. In addition to their technical expertise, <lastname> is an avid science communicator, hosting educational programs that bring the excitement of space exploration to a global audience. They epitomize the spirit of collaboration and innovation that defines the USA's involvement in space exploration, bridging the gap between technology and public engagement in the quest to unlock the secrets of the universe.",
			"Astronaut <firstname> <lastname> is a space scientist with a unique background in both geology and botany, contributing to American space missions. Their research on the adaptation of plants to extraterrestrial environments is crucial for future space agriculture. When not in orbit, <lastname> is an amateur astronomer, hosting public stargazing events to share their passion for the cosmos. Their dedication to the harmony between life and the universe reflects the USA's commitment to sustainable space exploration.",
			"Captain <firstname> <lastname> is an astronaut whose remarkable leadership has led the way for American space programs. With a background in psychology, they've focused on improving the mental well-being of astronauts during long-duration missions. <lastname> is also a published poet, capturing the emotions of space travel in verse. Their works inspire others to explore the human experience in space, emphasizing the USA's dedication to the holistic aspects of space exploration.",
			"Commander <firstname> <lastname> is an astronaut who has traversed the boundaries of space as part of American space missions, contributing to groundbreaking scientific research. In their spare time, <lastname> is an avid wildlife photographer, drawing parallels between the beauty of Earth's ecosystems and the wonders of the cosmos. Their photography not only inspires but also emphasizes the USA's commitment to preserving our planet while reaching for the stars.",
			"Astronaut <firstname> <lastname>, a visionary explorer operating within American space programs, specializes in the study of space weather and its effects on Earth. They are also an accomplished musician, composing celestial-inspired symphonies that resonate with audiences worldwide. <lastname> exemplifies the fusion of science and art, highlighting the USA's dedication to celebrating the beauty and mysteries of the universe through creative expression. In addition to their remarkable career and artistic talents, <lastname> is a loving partner and the proud parent of two children, enriching their life with family bonds that complement their cosmic pursuits.",
			"Commander <firstname> <lastname> is an astronaut known for their pioneering work in space archaeology, collaborating on American space missions. Their research on ancient celestial artifacts sheds light on humanity's historical fascination with the stars. When not uncovering the secrets of our cosmic past, <lastname> enjoys writing science fiction novels that explore the limitless possibilities of space travel. They embody the USA's commitment to blending history, exploration, and imagination in the quest to understand our place in the universe.",
			"Astronaut <firstname> <lastname> is a dedicated space scientist, contributing to American space missions with expertise in planetary geology. They are also an accomplished amateur astronomer, spending their free time stargazing and capturing the beauty of the night sky through astrophotography. <lastname>'s passion for celestial objects reflects their commitment to exploring both the depths of space and the wonders of Earth, embodying the spirit of American space exploration.",
			"Captain <firstname> <lastname> is an astronaut and visionary leader in American space programs. With a background in physics, they've played a pivotal role in the development of advanced propulsion systems. In their leisure moments, <lastname> enjoys woodworking, crafting intricate models of spacecraft and celestial bodies. Their hobby symbolizes their dedication to precision and craftsmanship, mirroring the USA's commitment to excellence in space exploration.",
			"Commander <firstname> <lastname> is an astronaut known for their pioneering work in space medicine and life support systems, contributing to American space missions. Off-duty, <lastname> is an avid rock climber, finding solace in scaling Earth's natural wonders. Their passion for exploration extends from the rocky terrain on our planet to the distant landscapes of space, aligning perfectly with the USA's spirit of adventure.",
			"Astronaut <firstname> <lastname>, a seasoned explorer within American space programs, specializing in astrobiology and the search for extraterrestrial life. They are also a passionate scuba diver, exploring the depths of Earth's oceans. Their underwater adventures parallel their quest for life beyond our planet, showcasing the USA's commitment to uncovering the mysteries of the cosmos and our own blue planet.",
			"Commander <firstname> <lastname> is an astronaut renowned for their contributions to American space missions, focusing on space habitat design. They are also a dedicated marathon runner, finding inspiration in the long and challenging journey of space exploration. <lastname>'s commitment to both space and running embodies the endurance, discipline, and determination that define the USA's pursuit of knowledge and progress beyond our planet.",
			"Astronaut <firstname> <lastname> is a distinguished space scientist contributing to American space missions with expertise in planetary geology. Off-duty, <lastname> enjoys immersing themselves in the world of literature, authoring science fiction novels that explore the limitless possibilities of space travel. Their passion for storytelling mirrors their commitment to unraveling the cosmic mysteries, embodying the spirit of American space exploration with each captivating tale.",
			"Captain <firstname> <lastname> is a visionary leader in American space programs, specializing in propulsion systems. In their leisure time, <lastname> is an avid painter, creating breathtaking cosmic landscapes that capture the universe's awe-inspiring beauty. Their artistry reflects the USA's commitment to embracing the artistic dimension of space exploration, transcending the boundaries of science and creativity. One noteworthy event in <lastname>'s life was their role in organizing an educational outreach program that connected students from around the world with astronauts from the space program, sparking young minds' interest in space and science.",
			"Commander <firstname> <lastname> is an astronaut renowned for their pioneering work in space medicine and life support systems, contributing to American space missions. When not exploring the cosmos, <lastname> immerses themselves in the world of photography, capturing Earth's natural wonders. Their photography serves as a testament to the fragile beauty of our planet, reinforcing the USA's commitment to responsible space exploration and environmental stewardship.",
			"Astronaut <firstname> <lastname>, a seasoned explorer within American space programs, specializes in astrobiology and the search for extraterrestrial life. They are also a passionate mountaineer, scaling the world's highest peaks. Their love for adventure extends from the heights of Earth's mountains to the depths of space, reflecting the USA's unwavering spirit of exploration and discovery. Beyond their extraordinary career and adventurous spirit, <lastname> enjoys a rich family life, cherishing moments spent with loved ones as they balance their cosmic and earthly pursuits.",
			"Commander <firstname> <lastname> is an astronaut celebrated for their contributions to American space missions, focusing on space habitat design. Beyond their duties in space, <lastname> is an accomplished classical musician, playing the violin with virtuosity. Their ability to harmonize complex melodies mirrors their dedication to the intricate designs of space habitats, embodying the spirit of American space exploration through the language of music and architecture.",
			"Astronaut <firstname> <lastname> is a distinguished member of the American space program, celebrated for their achievements as a world-class violinist. They honed their musical skills at the renowned Juilliard School in New York City, where they received a world-class education in music. Their virtuoso performances on Earth captivated audiences globally, and their unique talent earned them an invitation to join the space program. As a musician in space, <lastname> continues to captivate audiences, playing ethereal melodies in the cosmic silence. Beyond their musical prowess, <lastname> is an avid collector of antique musical instruments. They have amassed a remarkable collection, some of which have made the journey with them into the cosmos.",
			"Astronaut <firstname> <lastname> is celebrated for their contributions to the American space program, initially becoming famous as an award-winning author. They pursued their undergraduate studies in literature at Harvard University, where they developed a deep appreciation for storytelling. Their novels captured the imaginations of readers worldwide, making them a literary sensation. Their literary prowess led to an invitation to join the space program, where they now document their cosmic experiences through the written word. In their free time aboard the spacecraft, <lastname> continues to write, crafting stories that merge the realms of science fiction and reality. Their unique perspective as both an author and astronaut offers a profound insight into the human experience beyond Earth.",
			"Astronaut <firstname> <lastname> is a distinguished member of the American space program, celebrated for their achievements in aeronautics. They earned their bachelor's degree in Aerospace Engineering at the Massachusetts Institute of Technology (MIT), a renowned institution for aerospace studies. Their deep knowledge and expertise in the field led to an invitation to join the space program, where they continue to push the boundaries of space exploration. In addition to their technical skills, <lastname> is an avid skydiver, using their passion for freefall to better understand the sensation of zero gravity. Their experiences in the skies have served them well in the weightlessness of space.",
			"Astronaut <firstname> <lastname> is celebrated for their contributions to the American space program, having earned a Ph.D. in Astrophysics from Princeton University. Their research on cosmic phenomena and celestial bodies garnered international recognition. Their academic achievements made them a natural choice to join the space program, where they conduct groundbreaking research from the vantage point of space. Beyond their scientific pursuits, <lastname> is an amateur astronomer, often capturing breathtaking images of the cosmos during their free time in space. Their photographs provide a unique perspective on the universe.",
			"Commander <firstname> <lastname> is an esteemed astronaut renowned for their expertise in aeronautical engineering, with a degree from the California Institute of Technology (Caltech). Their technical prowess in designing and optimizing spacecraft systems led to an invitation to lead missions within the American space program. <lastname> is also a certified pilot, having logged numerous hours flying experimental aircraft. Their understanding of flight dynamics and control systems has been instrumental in ensuring the safety and success of space missions.",
			"Astronaut <firstname> <lastname>, a visionary explorer within the American space program, who earned their master's degree in Planetary Science from the University of Arizona. Their specialized knowledge in planetary geology and exploration prepared them for the challenges of exploring other celestial bodies. In their free time aboard the spacecraft, <lastname> conducts experiments related to planetary geology, using their scientific background to analyze the composition of extraterrestrial materials. Their work contributes to our understanding of the solar system.",
			"Astronaut <firstname> <lastname> is a dedicated member of the American space program, known for their expertise in astrobiology. They obtained their Ph.D. in Astrobiology from Stanford University, focusing on the search for life beyond Earth. Their unique background in this field made them a valuable addition to space missions exploring the potential for life on other planets. <lastname>'s commitment to astrobiology extends beyond their missions, as they actively participate in outreach programs to educate the public about the possibilities of extraterrestrial life. Their passion for discovery inspires the next generation of space enthusiasts.",
			"Astronaut <firstname> <lastname> is a distinguished member of the American space program, celebrated for their contributions to multiple ISS missions. With a background in aeronautical engineering, <lastname> brings technical expertise to the space program. Their dedication to space exploration has led to numerous missions in orbit. Beyond their technical role, <lastname> is an advocate for science outreach. They regularly engage with students on Earth, inspiring the next generation of scientists and engineers through live broadcasts from the ISS.",
			"Astronaut <firstname> <lastname> is celebrated for their extensive experience on the International Space Station. With a background in astrophysics, they have conducted groundbreaking experiments in microgravity, advancing our understanding of cosmic phenomena. <lastname> is an avid photographer, capturing stunning images of Earth from space. Their photographs serve as a visual diary of their time on the ISS, highlighting the beauty of our planet and the unique perspective of space.",
			"Commander <firstname> <lastname> is an esteemed astronaut renowned for their leadership on multiple ISS missions. Their background in aerospace engineering and aeronautics has been instrumental in ensuring the success of complex space missions. In their free time aboard the ISS, <lastname> enjoys composing music. Their melodies, played on specially designed instruments for the zero-gravity environment, add a touch of artistry to the scientific endeavors on the station.",
			"Astronaut <firstname> <lastname> is a dedicated member of the American space program, celebrated for their contributions to numerous ISS missions. Their background in microbiology has allowed them to conduct critical experiments related to human health and biology in the unique environment of the space station. <lastname>'s passion for fitness extends into space, where they have developed specialized exercise routines to combat the effects of prolonged weightlessness. Their dedication to physical well-being benefits not only themselves but also future astronauts embarking on ISS missions.",
			"Astronaut <firstname> <lastname> is a distinguished member of the American space program, celebrated for their achievements in aeronautics. They earned their bachelor's degree in Aerospace Engineering at the California Institute of Technology (Caltech), a prestigious institution for aerospace studies. Their deep knowledge and expertise in the field led to an invitation to join the space program, where they continue to push the boundaries of space exploration. In addition to their technical skills, <lastname> is an accomplished pilot, holding multiple licenses for both fixed-wing aircraft and helicopters. Their extensive flight experience contributes to their exceptional performance during space missions.",
			"Astronaut <firstname> <lastname> is a dedicated member of the American space program, celebrated for their expertise in aeronautics. They obtained their bachelor's degree in Aerospace Engineering from the University of Texas at Austin, a leading institution for aerospace studies. Their deep understanding of spacecraft design and operation earned them a place among the elite ranks of astronauts. In addition to their technical skills, <lastname> is an accomplished pilot of high-performance aircraft. Their precision and quick decision-making abilities developed in the cockpit have translated seamlessly to their responsibilities during space missions.",
			"Astronaut <firstname> <lastname> is a distinguished member of the American space program and a direct descendant of the legendary astronaut John Glenn. Inspired by their famous ancestor's legacy, <lastname> pursued their education in Aerospace Engineering, earning a degree from the Massachusetts Institute of Technology (MIT). Their passion for space and determination to honor their family's heritage led to an invitation to join the space program. <lastname> continues to uphold the Glenn legacy with each mission, pushing the boundaries of space exploration.",
			"Astronaut <firstname> <lastname> follows in the footsteps of their famous relative, the iconic astronaut Neil Armstrong. With a bachelor's degree in Aeronautical Engineering from Purdue University, <lastname> carries on the Armstrong tradition of space exploration. Their exceptional skills and dedication to aerospace science earned them a place among the elite astronauts of the American space program. <lastname> proudly continues the family's commitment to expanding our understanding of the cosmos.",
			"Commander <firstname> <lastname> is an esteemed astronaut known for their remarkable career and their familial connection to astronaut Sally Ride. As a relative of the groundbreaking astronaut, <lastname> was inspired to pursue a career in space. They completed their education in Aerospace Engineering at Stanford University, where their academic excellence propelled them into the space program. <lastname> honors Ride's legacy by contributing to space exploration through their technical expertise and leadership.",
			"Astronaut <firstname> <lastname>, a visionary explorer within the American space program and a descendant of astronaut Alan Shepard. With a degree in Mechanical Engineering from the University of Texas at Austin, <lastname> carries on the Shepard family tradition of pioneering space missions. Their dedication to space exploration and their family's historic achievements make them a vital asset to the space program. <lastname> continues to push the boundaries of human exploration, just as their famous ancestor did.",
			"Astronaut <firstname> <lastname> is a dedicated member of the American space program, recognized for their familial connection to astronaut Christa McAuliffe. Inspired by McAuliffe's legacy, <lastname> pursued their education in Aerospace Engineering, earning a degree from the California Institute of Technology (Caltech). Their passion for education and space exploration led to an invitation to join the space program. <lastname> proudly carries on McAuliffe's mission to inspire and educate future generations about the wonders of space.",
			"Astronaut <firstname> <lastname> is a distinguished member of the American space program, celebrated for their achievements both in the military and in space. With a decorated military career, including combat missions as a fighter pilot, <lastname> exemplifies the qualities of courage and leadership. After obtaining their degree in Aerospace Engineering from the Massachusetts Institute of Technology (MIT), they joined the space program. Their combat experience has proven invaluable in high-pressure space missions, and their dedication to advancing space exploration is unwavering.",
			"Astronaut <firstname> <lastname> is renowned for their exceptional service in the armed forces, including combat missions as a Navy SEAL. Their military background, combined with a degree in Aeronautical Engineering from Purdue University, prepared them for a distinguished career in space exploration. <lastname>'s combat-tested skills have been an asset in various space missions, making them a respected astronaut within the American space program.",
			"Commander <firstname> <lastname> is an esteemed astronaut, known for their leadership in both the military and space. They have a decorated military career, which includes combat missions as an Air Force pilot. After earning a degree in Mechanical Engineering from the University of Texas at Austin, <lastname> joined the space program. Their combat experience has honed their decision-making abilities and contributed to their success as an astronaut.",
			"Astronaut <firstname> <lastname>, a visionary explorer within the American space program, who brings a wealth of military expertise to their missions. They served as a combat pilot in the Marine Corps, demonstrating exceptional courage and dedication. With a degree in Aerospace Engineering from Stanford University, <lastname> combines their military background with technical prowess to excel in space exploration. Their combat experience has prepared them to handle the challenges of space with resilience and composure.",
			"Astronaut <firstname> <lastname> is a dedicated member of the American space program, celebrated for their distinguished military service that includes combat missions as an Army Ranger. Their combat-tested skills and leadership abilities, combined with a degree in Aerospace Engineering from the California Institute of Technology (Caltech), made them an ideal candidate for the space program. <lastname>'s experience in high-stress combat situations has translated seamlessly to the challenges of space exploration, where they continue to make significant contributions.",
			"Astronaut <firstname> <lastname> hails from a renowned American family with a legacy deeply rooted in space exploration. Their lineage includes pioneers who played key roles in early space missions. Inspired by their family's heritage, <lastname> pursued a degree in Aerospace Engineering at the Massachusetts Institute of Technology (MIT). Their commitment to continuing the family tradition led to an invitation to join the American space program, where they contribute to the ongoing legacy of space exploration.",
			"Astronaut <firstname> <lastname>, a visionary explorer within the American space program, who is part of a historic American family deeply linked to space exploration. Their family's legacy includes astronauts who ventured into the cosmos. With a degree in Aerospace Engineering from Stanford University, <lastname> follows in the footsteps of their relatives, contributing to the ongoing narrative of space exploration. Their family's dedication to space inspires <lastname> in their mission to explore the cosmos."
		],
	},
	{
		"Name": "European",
		"PicturePath": "culture_pictures/european.png",
		"NationalityWeights": {
			"France" : 30,
			"Germany" : 30,
			"Great Britain" : 20,
            "Italy" : 20,
			"Spain" : 20,
			"Netherlands" : 20,
			"Austria" : 10,
			"Denmark" : 10,
            "Norway" : 10,
            "Estonia" : 10,
            "Finland" : 10,
			"Czechia" : 10,
			"Ireland" : 10,
			"Poland" : 10,
			"Romania" : 10,
			"Portugal" : 10,
			"Greece" : 10,
			"Luxembourg" : 10,
            "Hungary" : 10,
			"Swiss" : 10,
			"Belgium" : 10,
            "Sweden" : 10,
			"Croatia" : 5,
			"Slovenia" : 5,
			"Lithuania" : 5,
			"Latvia" : 5,
			"Iceland" : 3,
			"Bosnia and Herzegovina" : 2,
            "Turkey" : 2,
            "Serbia" : 2,
            "Macedonia" : 2,
			"Kosovo" : 2,
            "Albania" : 2,
			"Slovakia" : 2,
			"Malta" : 2,
            "USA" : 1,
            "Israel" : 1,
            "Kazakhstan" : 1,
            "Arabia" : 1,
            "Azerbaijan" : 1,
            "Moldova" : 1,
            "Korea" : 1,
            "Japan" : 1,
            "Montenegro" : 1,
            "Armenia" : 1,
            "China" : 1,
            "India" : 1,
            "Georgia" : 1,
            "Belarus" : 1,
            "Bulgaria" : 1,
            "Russia" : 1,
            "Ukraine" : 1,
            "Vietnam" : 1
		},
		"SkinColorTypeWeights": {
			"Real" : 15,
			"Fair" : 15,
			"Dark" : 3,
			"Caucasian" : 15,
			"Indian" : 3,
			"BeautifulTouch" : 20,
			"Ebony" : 3,
			"NormalAndTan" : 15,
			"Natural" : 5,
			"Asian" : 3,
			"Black" : 3,
			"Kerbal" : 0
		},
		"SuitColor1": {
            "r": 0,
            "g": 50,
            "b": 150,
            "a": 255
		},
		"SuitColor2": {
            "r": 200,
            "g": 200,
            "b": 200,
            "a": 255
		},
		"Biographies": [
			"Astronaut <firstname> <lastname> is a distinguished space scientist contributing to European space missions with expertise in planetary geology. Off-duty, <lastname> enjoys immersing themselves in the world of literature, authoring science fiction novels that explore the limitless possibilities of space travel. Their passion for storytelling mirrors their commitment to unraveling the cosmic mysteries, embodying the spirit of European space exploration with each captivating tale.",
			"Captain <firstname> <lastname> is a visionary leader in European space programs, specializing in propulsion systems. In their leisure time, <lastname> is an avid painter, creating breathtaking cosmic landscapes that capture the awe-inspiring beauty of the universe. Their artistry reflects Europe's commitment to embracing the artistic dimension of space exploration, transcending the boundaries of science and creativity. Outside of their rigorous training and missions, <lastname> values the precious moments spent with their caring partner and three children.",
			"Commander <firstname> <lastname> is an astronaut renowned for their pioneering work in space medicine and life support systems, contributing to European space missions. When not exploring the cosmos, <lastname> immerses themselves in the world of photography, capturing Earth's natural wonders. Their photography serves as a testament to the fragile beauty of our planet, reinforcing Europe's commitment to responsible space exploration and environmental stewardship.",
			"Astronaut <firstname> <lastname>, a seasoned explorer within European space programs, specializing in astrobiology and the search for extraterrestrial life. They are also a passionate mountaineer, scaling the world's highest peaks. Their love for adventure extends from the heights of Earth's mountains to the depths of space, reflecting Europe's unwavering spirit of exploration and discovery. In addition to their professional life, <lastname> cherishes the moments spent with their devoted partner and two children.",
			"Commander <firstname> <lastname> is an astronaut celebrated for their contributions to European space missions, focusing on space habitat design. Beyond their duties in space, <lastname> is an accomplished classical musician, playing the violin with virtuosity. Their ability to harmonize complex melodies mirrors their dedication to the intricate designs of space habitats, embodying the spirit of European space exploration through the language of music and architecture.",
			"Commander <firstname> <lastname> is an esteemed combat pilot with a remarkable history of serving in combat operations abroad. Their combat leadership skills are highly regarded, and their transition to the European space program brings a new chapter in their career. With a background in Planetary Science, <lastname> combines their combat experience with their passion for amateur astronomy, spending their free time observing celestial objects.",
			"Captain <firstname> <lastname> is a visionary leader in European space programs, specializing in spacecraft navigation. Off-duty, <lastname> is a competitive chess player, mastering the strategic intricacies of the game. Their chess expertise reflects Europe's dedication to precision and strategy in space missions, where every move counts. One fascinating detail about <lastname> is their reputation as a 'chess in space' advocate. They once orchestrated a live chess game played between astronauts on the International Space Station and chess enthusiasts on Earth, using a special space-themed chess set. This event captured the imagination of people worldwide, highlighting the intersection of space exploration and intellectual pursuits, and inspiring a new generation of chess enthusiasts and space enthusiasts alike.",
			"Commander <firstname> <lastname> is an astronaut renowned for their contributions to European space missions, with a focus on planetary geology. Beyond their scientific endeavors, <lastname> is an enthusiastic equestrian, finding solace and connection with nature through horseback riding. Their passion for both the mysteries of space and the tranquility of Earth mirrors Europe's balanced approach to exploration and environmental harmony.",
			"Astronaut <firstname> <lastname>, an experienced explorer within European space programs, specializing in space archaeology. In their spare time, <lastname> is a dedicated archaeologist on Earth, unearthing historical artifacts that connect humanity's past to our cosmic future. Their love for history and space exploration embodies Europe's commitment to understanding the relationship between our origins and the cosmos.",
			"Commander <firstname> <lastname> is an astronaut celebrated for their contributions to European space missions, focusing on space habitat design. Outside of their space endeavors, <lastname> is a talented chef, using culinary arts to explore the fusion of flavors from around the world. Their culinary creativity reflects Europe's dedication to cultural diversity and international collaboration, both on Earth and in the pursuit of cosmic knowledge.",
			"Astronaut <firstname> <lastname> is a renowned space scientist, contributing to European space missions with expertise in astrophysics. In their free time, <lastname> is an avid skydiver, seeking the ultimate thrill of freefalling from the edge of space. Their passion for both studying the cosmos and experiencing the exhilaration of Earth's skies reflects their adventurous spirit.",
			"Captain <firstname> <lastname> is a respected leader in European space programs, specializing in spacecraft navigation. Off-duty, <lastname> is a passionate jazz pianist, finding solace in the rhythm and melody of music. Their piano compositions serve as a creative outlet, offering a harmonious counterpoint to the precision of space navigation. Interestingly, <lastname> once collaborated with a fellow astronaut who was a saxophonist to create a unique musical performance in microgravity aboard the International Space Station. Their celestial jam session, captured on video, resonated with audiences worldwide, symbolizing the harmony that can exist between science and art even in the most unconventional settings. This memorable event showcased <lastname>'s ability to bridge the gap between the worlds of space exploration and artistic expression, inspiring a deeper appreciation for both.",
			"Commander <firstname> <lastname> is an astronaut known for their expertise in planetary geology within European space missions. Beyond their scientific pursuits, <lastname> is a dedicated surfer, chasing the world's most challenging waves. Surfing represents their connection to Earth's natural forces and their love for the thrill of riding the ocean's energy. An interesting facet of <lastname>'s life is their role in developing specialized geological mapping techniques while riding ocean waves. They have successfully adapted their planetary geology knowledge to improve our understanding of seafloor geology. This unique intersection of their passion for surfing and expertise in planetary science has led to innovative approaches to geological exploration both on Earth and in space.",
			"Astronaut <firstname> <lastname>, a seasoned explorer within European space programs, specializing in space archaeology. In their spare time, <lastname> is a devoted landscape painter, capturing the beauty of landscapes both on Earth and in distant worlds. Their artwork serves as a bridge between the past and future, blending the mysteries of history with the wonders of the cosmos. ",
			"Commander <firstname> <lastname> is an astronaut celebrated for their contributions to European space missions, with a focus on space habitat design. Outside of their space endeavors, <lastname> is a passionate rock climber, scaling challenging peaks worldwide. Rock climbing symbolizes their commitment to conquering challenges, both on Earth and in the pursuit of celestial exploration.",
			"Astronaut <firstname> <lastname> is a renowned space scientist, contributing to European space missions with expertise in astrophysics. When not immersed in cosmic phenomena, <lastname> finds serenity as an accomplished wildlife photographer. They journey to the most remote corners of the world, capturing elusive creatures in their natural habitats. Photography offers <lastname> a profound connection with the planet's diverse ecosystems, a stark contrast to the cosmic expanses they explore professionally.",
			"Captain <firstname> <lastname> is a celebrated leader in European space programs, specializing in spacecraft navigation. Beyond their precision work in space, <lastname> is an accomplished guitarist. With nimble fingers, they create soul-stirring melodies that resonate through the corridors of their spacecraft during long missions. The guitar serves as both a creative outlet and a source of comfort, offering a respite from the sterile precision of celestial navigation.",
			"Commander <firstname> <lastname> is an astronaut known for their expertise in planetary geology within European space missions. Outside of their scientific pursuits, <lastname> is a passionate marathon runner. They lace up their running shoes and tackle grueling races worldwide, embracing the physical and mental challenges of the sport. Running symbolizes <lastname>'s determination and discipline, qualities that serve them well both on Earth and in their cosmic explorations.",
			"Astronaut <firstname> <lastname>, a seasoned explorer within European space programs, specializing in space archaeology. When not uncovering cosmic artifacts, <lastname> channels their creativity into writing intricate fantasy novels. Their literary worlds transport readers to realms beyond imagination, mirroring the depth and complexity of the cosmic mysteries they unravel professionally.",
			"Commander <firstname> <lastname> is an astronaut celebrated for their contributions to European space missions, with a focus on space habitat design. Beyond their space endeavors, <lastname> is an enthusiastic beer enthusiast and brewmaster. They meticulously brew their own craft beers, finding solace in the Earth's natural processes, a stark contrast to the controlled environments of space habitats. Beer brewing represents <lastname>'s deep connection to the Earth and its timeless traditions, complementing their passion for cosmic innovation. Outside of their professional and brewing pursuits, <lastname> is a devoted partner and parent to three loving children, balancing their cosmic aspirations with a fulfilling family life.",
			"Astronaut <firstname> <lastname> is a distinguished space scientist, contributing to European space missions with expertise in astrophysics. When not delving into cosmic phenomena, <lastname> finds solace as an accomplished wildlife photographer. They journey to the most remote corners of the world, capturing elusive creatures in their natural habitats. Photography offers <lastname> a profound connection with the planet's diverse ecosystems, a stark contrast to the cosmic expanses they explore professionally. In addition to their terrestrial pursuits, <lastname> conducted fieldwork in Toulouse, France, a city renowned for its contributions to space exploration. While there, they engaged with experts in the field and studied the latest advancements in space technology. This experience further fueled their passion for understanding both Earth and the cosmos, blending the scientific and artistic aspects of exploration.",
			"Captain <firstname> <lastname> is a celebrated leader in European space programs, specializing in spacecraft navigation. Beyond their precision work in space, <lastname> is an accomplished guitarist. With nimble fingers, they create soul-stirring melodies that resonate through the corridors of their spacecraft during long missions. The guitar serves as both a creative outlet and a source of comfort, offering a respite from the sterile precision of celestial navigation. During their career, <lastname> conducted fieldwork in Bremen, Germany, a city known for its pivotal role in European space endeavors. They collaborated with experts at the European Space Agency (ESA) and gained firsthand experience in spacecraft navigation systems. This fieldwork solidified their dedication to exploring the cosmos and using music as a bridge between the scientific and artistic realms.",
			"Commander <firstname> <lastname> is an astronaut known for their expertise in planetary geology within European space missions. Outside of their scientific pursuits, <lastname> is a passionate marathon runner. They lace up their running shoes and tackle grueling races worldwide, embracing the physical and mental challenges of the sport. Running symbolizes <lastname>'s determination and discipline, qualities that serve them well both on Earth and in their cosmic explorations. <lastname>'s connection with European space activities took them to Darmstadt, Germany, a hub for space mission operations. Here, they engaged in fieldwork and collaborated with experts at the European Space Operations Centre (ESOC). This experience deepened their understanding of the intricacies of space missions and reinforced their commitment to the exploration of celestial bodies.",
			"Astronaut <firstname> <lastname>, a seasoned explorer within European space programs, specializing in space archaeology. When not uncovering cosmic artifacts, <lastname> channels their creativity into writing intricate fantasy novels. Their literary worlds transport readers to realms beyond imagination, mirroring the depth and complexity of the cosmic mysteries they unravel professionally. During their career, <lastname> conducted fieldwork in Toulouse, France, a city known for its aerospace industry and contributions to European space activities. This experience immersed them in the rich history of space exploration and inspired their writing. <lastname> continues to draw parallels between the ancient past and the future of cosmic discovery in their novels.",
			"Commander <firstname> <lastname> is an astronaut celebrated for their contributions to European space missions, with a focus on space habitat design. Beyond their space endeavors, <lastname> is an enthusiastic wine enthusiast and vintner. They carefully cultivate their own vineyard and produce fine wines, finding solace in the Earth's natural processes, a stark contrast to the controlled environments of space habitats. Wine-making represents <lastname>'s deep connection to the Earth and its timeless traditions, complementing their passion for cosmic innovation. <lastname>'s fieldwork led them to Noordwijk, the Netherlands, a city known for its space research facilities, including the European Space Research and Technology Centre (ESTEC). Here, they worked on projects related to space habitat design, gaining insights that influenced their approach to creating sustainable living spaces beyond Earth.",
			"Astronaut <firstname> <lastname> is a distinguished space scientist, contributing to European space missions with expertise in astrophysics. Beyond their astronomical pursuits, <lastname> is an avid mountain climber. They scale some of the world's most challenging peaks, seeking adventure and pushing the limits of human exploration on Earth. This thrill of conquering mountains stands in contrast to their professional exploration of the cosmos. <lastname> is also a dedicated advocate for science education, frequently giving talks and engaging with students to inspire the next generation of space scientists. Their ability to bridge the gap between their scientific knowledge and their passion for adventure makes them a unique and inspiring figure in the world of space exploration.",
			"Captain <firstname> <lastname> is a celebrated leader in European space programs, specializing in spacecraft navigation. Beyond their precision work in space, <lastname> is an accomplished guitarist. With nimble fingers, they create soul-stirring melodies that resonate through the corridors of their spacecraft during long missions. The guitar serves as both a creative outlet and a source of comfort, offering a respite from the sterile precision of celestial navigation. Throughout their career, <lastname> has frequently visited Bremen, Germany, a city known for its pivotal role in European space endeavors. They collaborated with experts at the European Space Agency (ESA) and gained firsthand experience in spacecraft navigation systems. This city has become a source of inspiration for <lastname>, blending their passion for music with their dedication to space exploration.",
			"Commander <firstname> <lastname> is an astronaut known for their expertise in planetary geology within European space missions. Outside of their scientific pursuits, <lastname> is a passionate marathon runner. They lace up their running shoes and tackle grueling races worldwide, embracing the physical and mental challenges of the sport. Running symbolizes <lastname>'s determination and discipline, qualities that serve them well both on Earth and in their cosmic explorations. <lastname>'s connection with European space activities led them to Darmstadt, Germany, a hub for space mission operations. Here, they engaged in discussions and collaborated with experts at the European Space Operations Centre (ESOC). This experience deepened their understanding of the intricacies of space missions and reinforced their commitment to the exploration of celestial bodies.",
			"Astronaut <firstname> <lastname>, a seasoned explorer within European space programs, specializing in space archaeology. When not uncovering cosmic artifacts, <lastname> channels their creativity into writing intricate fantasy novels. Their literary worlds transport readers to realms beyond imagination, mirroring the depth and complexity of the cosmic mysteries they unravel professionally. During their career, <lastname> has immersed themselves in the atmosphere of Toulouse, France, a city known for its aerospace industry and contributions to European space activities. This experience immersed them in the rich history of space exploration and inspired their writing. <lastname> continues to draw parallels between the ancient past and the future of cosmic discovery in their novels.",
			"Commander <firstname> <lastname> is an astronaut celebrated for their contributions to European space missions, with a focus on space habitat design. Beyond their space endeavors, <lastname> is a wine enthusiast. They carefully cultivate their own vineyard and produce fine wines, finding solace in the Earth's natural processes, a stark contrast to the environments of space habitats. Wine-making represents <lastname>'s deep connection to the Earth and its timeless traditions, complementing their passion for cosmic innovation. <lastname>'s involvement in European space activities has frequently brought them to Noordwijk, the Netherlands, a city known for its space research facilities, including the European Space Research and Technology Centre (ESTEC). Here, they worked on projects related to space habitat design, gaining insights that influenced their approach to creating sustainable living spaces beyond Earth.",
			"Astronaut <firstname> <lastname> is a celebrated member of the European space program, whose civilian career as an environmental engineer earned them a place among the stars. When not on cosmic missions, <lastname> immerses themselves in the world of music as an accomplished cellist. Their melodic compositions capture the beauty of the universe and provide a sense of serenity amidst the vastness of space. Throughout their career, <lastname> has frequently visited Bremen, Germany, a city known for its pivotal role in European space endeavors. They collaborated with experts at the European Space Agency (ESA) and gained firsthand experience in environmental engineering systems. This city has become a source of inspiration for <lastname>, blending their passion for music with their dedication to space exploration.",
			"Astronaut <firstname> <lastname>, a seasoned explorer within European space programs, who embarked on a cosmic journey from a background in architecture. When not sketching plans for space habitats, <lastname> channels their creativity into writing intricate science fiction novels. Their literary worlds transport readers to realms beyond imagination, mirroring the depth and complexity of the cosmic mysteries they unravel professionally. During their career, <lastname> has immersed themselves in the atmosphere of Toulouse, France, a city known for its aerospace industry and contributions to European space activities. This experience immersed them in the rich history of space exploration and inspired their writing. <lastname> continues to draw parallels between the ancient past and the future of cosmic discovery in their novels.",
			"Commander <firstname> <lastname> is an astronaut celebrated for their contributions to European space missions, with a background as a civil engineer specializing in aerospace infrastructure development. Beyond their space endeavors, <lastname> is a beer connoisseur. They carefully craft their own microbrews, finding solace in the Earth's natural processes, a stark contrast to the controlled environments of space missions. Beer brewing represents <lastname>'s deep connection to the Earth and its timeless traditions, complementing their passion for cosmic innovation. <lastname>'s involvement in European space activities has frequently brought them to Noordwijk, the Netherlands, and its space research facilities, including the European Space Research and Technology Centre (ESTEC). Here, they worked on various projects, gaining insights that influenced their approach to creating sustainable living spaces beyond Earth.",
			"Astronaut <firstname> <lastname> is a dedicated environmental scientist who earned a spot in the European space program due to their expertise in sustainable living systems. When not conducting experiments in space, <lastname> takes to the stage as an accomplished actor. Their performances bring the drama of cosmic exploration to life, captivating audiences with tales of the universe. In addition to their cosmic pursuits, <lastname> has spent time in Darmstadt, Germany, a hub for space mission operations. Here, they collaborated with experts at the European Space Operations Centre (ESOC), gaining firsthand experience in space mission coordination. This city has become a source of inspiration for <lastname>, blending their passion for theater with their dedication to space exploration.",
			"Astronaut <firstname> <lastname> is a distinguished member of the European space program, celebrated for their contributions to space exploration. They embarked on their journey by earning a degree in Aerospace Engineering at the Massachusetts Institute of Technology (MIT), a renowned American institution. Their international training background and technical expertise made them an ideal candidate for the European space program, where they continue to push the boundaries of space exploration.",
			"Astronaut <firstname> <lastname> is a promising newcomer to the European space program, having recently joined as a rookie astronaut. <lastname> holds a degree in Aerospace Engineering, which they earned with the highest honors. Their academic excellence during their education at the Massachusetts Institute of Technology (MIT), a prestigious American institution, caught the attention of the space program. <lastname> is eager to embark on their space exploration journey and contribute to the future of European space missions.",
			"Astronaut <firstname> <lastname> is an emerging talent within the European space program, having just begun their astronaut career. Graduating with the highest honors in Aeronautical Engineering from Purdue University, a renowned American institution, <lastname> demonstrates exceptional potential. Their determination and academic achievements have opened doors to the space program, where they are poised to learn and grow while making valuable contributions to upcoming missions.",
			"Astronaut <firstname> <lastname> is an enthusiastic newcomer to the European space program, eager to learn and grow in their role as an astronaut. They graduated with the highest honors in Aerospace Engineering from the California Institute of Technology (Caltech), a prestigious American university. <lastname>'s exceptional academic achievements have positioned them for a successful start in the space program. Outside of their astronaut training, <lastname> is a talented pianist, finding solace and inspiration in playing classical compositions. Their dedication to space exploration and artistic pursuits enrich their journey in the program.",
			"Astronaut <firstname> <lastname>, a fresh face in the European space program with a promising future. Graduating with the highest honors in Aerospace Engineering from Stanford University, a prestigious American institution, <lastname> has quickly risen through the ranks. Beyond their academic achievements and astronaut training, <lastname> is an exceptional astrophotographer, capturing breathtaking images of celestial objects from their perspective on Earth. Their artistic eye and technical expertise enhance their contributions to space exploration.",
			"Astronaut <firstname> <lastname> is an emerging talent within the European space program, having just begun their astronaut career. Graduating with the highest honors in Aeronautical Engineering from the University of Cambridge, a renowned European institution, <lastname> demonstrates exceptional potential. Their determination and academic achievements have opened doors to the space program. In their spare time, <lastname> is an avid rock climber, mastering challenging peaks and using their problem-solving skills to excel in this thrilling hobby.",
			"Astronaut <firstname> <lastname>, a fresh face in the European space program with a promising future. Graduating with the highest honors in Aerospace Engineering from the Technical University of Munich, a renowned European institution, <lastname> has quickly risen through the ranks. Beyond their academic achievements and astronaut training, <lastname> is an exceptional astrophotographer, capturing breathtaking images of celestial objects from their perspective on Earth. Their artistic eye and technical expertise enhance their contributions to space exploration.",
			"Astronaut <firstname> <lastname> is a rising star in the European space program, known for their impressive achievements in the field of astrophysics. With a Ph.D. in Astrophysics from the University of Cambridge, where they graduated with highest honors, <lastname> has authored several groundbreaking research papers that have expanded our understanding of the cosmos. Their contributions to space science caught the attention of the space program, and they are now embarking on a new chapter in their career as an astronaut, eager to apply their scientific expertise to future space missions.",
			"Astronaut <firstname> <lastname> brings a wealth of scientific knowledge to the European space program. With a background in Planetary Science and a Ph.D. from the Sorbonne University in Paris, <lastname> has published numerous influential papers on planetary exploration and geology. Their expertise and research contributions have positioned them as a valuable asset to the space program, where they are ready to apply their scientific insights to upcoming missions.",
			"Commander <firstname> <lastname> is an esteemed astronaut within the European space program, known for their dual expertise in space science and leadership. Holding a Ph.D. in Space Physics from the Max Planck Institute, where they graduated with highest honors, <lastname> has authored significant research papers in the field of space weather and solar physics. Their scientific background, combined with their leadership skills, makes them an ideal choice for commanding space missions.",
			"Astronaut <firstname> <lastname> is a rising star in the European space program, celebrated for their scientific achievements in astrophysics. With a Ph.D. in Astrophysics from the University of Cambridge, where they graduated with highest honors, <lastname> has authored groundbreaking research papers that have expanded our understanding of the cosmos. Outside of their work, <lastname> is an avid amateur astronomer, spending countless nights observing celestial objects through their personal telescope. Their passion for both professional and amateur astronomy enriches their contributions to space science.",
			"Commander <firstname> <lastname> is an esteemed astronaut-scientist within the European space program, celebrated for their contributions to space physics and solar research. Holding a Ph.D. in Space Physics from the Max Planck Institute, where they graduated with highest honors, <lastname> has authored significant research papers. Beyond their scientific endeavors, <lastname> is a dedicated scuba diver, exploring the depths of our oceans. Their underwater experiences provide a unique perspective that complements their space missions.",
			"Astronaut <firstname> <lastname> is a seasoned member of the European space program, having contributed to various missions in a scientific capacity for several years. With a Ph.D. in Astrophysics from the University of Cambridge, where they graduated with highest honors, <lastname> has authored groundbreaking research papers in the field. After years of dedication and expertise, they finally received the opportunity to become a full-fledged astronaut, allowing them to directly contribute to space exploration while continuing to share their passion for amateur astronomy.",
			"Astronaut <firstname> <lastname> is a promising astronaut-scientist in the European space program, known for their scientific background in astrobiology. Holding a Ph.D. from the University of Edinburgh, where they graduated with highest honors, <lastname> conducted extensive research on extremophiles and their potential relevance to extraterrestrial life. After years of preparation and contributions to the program, <lastname> finally achieved their dream of becoming an astronaut. Their unique experiences and passion for mountaineering, drawing parallels between extreme environments on Earth and space exploration, enrich their astronaut career.",
			"Astronaut <firstname> <lastname> is a distinguished engineer-astronaut in the European space program, celebrated for their expertise in Aerospace Engineering. They have actively participated in space missions and supported various projects with their engineering skills. After a substantial tenure in the space program, <lastname> fulfilled their dream of becoming an astronaut. Now, they combine their engineering knowledge with hands-on space exploration while continuing their hobby as an avid rock climber.",
			"Astronaut <firstname> <lastname> is a distinguished combat pilot with a history of serving in combat operations abroad. Their exceptional courage and leadership skills have been tested in high-pressure situations. With a background in Aeronautical Engineering, <lastname> transitioned to the European space program, where they are now preparing for space missions. Outside of their training, <lastname> is an avid mountaineer, finding solace and inspiration in conquering challenging peaks."
		],
	},
	{
		"Name": "Chinese",
		"PicturePath": "culture_pictures/chinese.png",
		"NationalityWeights": {
			"China" : 300,
			"Russia" : 10,
			"France" : 10,
			"Arabia" : 5,
			"India" : 5,
			"Vietnam" : 5,
			"USA" : 2,
			"Korea" : 2,
			"Denmark" : 1,
			"Norway" : 1,
			"Estonia" : 1,
			"Finland" : 1,
			"Israel" : 1,
			"Kazakhstan" : 1,
			"Bosnia and Herzegovina" : 1,
			"Turkey" : 1,
			"Portugal" : 1,
			"Greece" : 1,
			"Germany" : 1,
			"Macedonia" : 1,
			"Netherlands" : 1,
			"Great Britain" : 1,
			"Italy" : 1,
			"Iceland" : 1,
			"Poland" : 1,
			"Spain" : 1,
			"Romania" : 1,
			"Lithuania" : 1,
			"Austria" : 1,
			"Kosovo" : 1,
			"Albania" : 1,
			"Azerbaijan" : 1,
			"Swiss" : 1,
			"Moldova" : 1,
			"Ireland" : 1,
			"Slovakia" : 1,
			"Luxembourg" : 1,
			"Hungary" : 1,
			"Latvia" : 1,
			"Belgium" : 1,
			"Sweden" : 1,
			"Japan" : 1,
			"Montenegro" : 1,
			"Armenia" : 1,
			"Georgia" : 1,
			"Belarus" : 1,
			"Bulgaria" : 1,
			"Malta" : 1,
			"Serbia" : 1,
			"Slovenia" : 1,
			"Ukraine" : 1,
			"Czechia" : 1,
			"Croatia" : 1
		},
		"SkinColorTypeWeights": {
			"Real" : 0,
			"Fair" : 10,
			"Dark" : 0,
			"Caucasian" : 0,
			"Indian" : 0,
			"BeautifulTouch" : 10,
			"Ebony" : 0,
			"NormalAndTan" : 20,
			"Natural" : 30,
			"Asian" : 30,
			"Black" : 0,
			"Kerbal" : 0
		},
		"SuitColor1": {
            "r": 200,
            "g": 40,
            "b": 0,
            "a": 255
		},
		"SuitColor2": {
            "r": 200,
            "g": 200,
            "b": 200,
            "a": 255
		},
		"Biographies": [
			"Colonel <firstname> <lastname> is a distinguished taikonaut in the Chinese space program, hailing from a military background as a highly skilled fighter pilot. Beyond their military service, <lastname> has a passion for music, mastering the piano over the years. Their celestial melodies have echoed through the confines of space stations, providing a sense of serenity and creativity amidst the challenges of space travel. In addition to their military duties, <lastname> has spent time in Beijing, China, where they honed their skills as a test pilot. Beijing, the capital of China, played a significant role in their aviation career. This experience in the bustling metropolis further enriched their dedication to aerospace exploration.",
			"Colonel <firstname> <lastname> is a celebrated member of the Chinese space program, with a military rank earned through their exceptional service as an air force pilot. When not navigating the skies, <lastname> immerses themselves in the world of mathematics, contributing to advanced algorithms used in space missions. Their mathematical precision complements the challenges of space exploration. Throughout their career, <lastname> has spent considerable time in Xi'an, China, a city steeped in history and known for its technological advancements. It was in this city that <lastname> developed a deep appreciation for the intersection of tradition and innovation, a theme that echoes in their work as an taikonaut.",
			"Commander <firstname> <lastname> is an taikonaut celebrated in the Chinese space program, having risen through the ranks of the air force. Beyond their military responsibilities, <lastname> is an avid mountaineer, conquering some of the world's highest peaks. Their love for adventure and physical endurance extends from Earth's mountains to the challenges of space travel. <lastname> has spent significant time in Beijing, China, where they trained as a fighter pilot and honed their leadership skills. Beijing's vibrant culture and rich history have left a lasting impression on <lastname>, shaping their perspective on teamwork and exploration.",
			"Taikonaut <firstname> <lastname>, a seasoned explorer within the Chinese space program, whose military career as a combat pilot paved the way for cosmic journeys. When not on space missions, <lastname> channels their creativity into writing intricate science fiction novels. Their literary worlds transport readers to realms beyond imagination, mirroring the depth and complexity of the cosmic mysteries they unravel professionally. During their career, <lastname> has frequently visited Shanghai, China, a city known for its dynamism and rapid technological advancements. This experience immersed them in the bustling energy of progress and innovation, which they draw upon in their novels that envision the future of space exploration.",
			"Colonel <firstname> <lastname> is a dedicated taikonaut with a military rank, chosen for the Chinese space program due to their expertise as an aerospace engineer. Beyond their military duties, <lastname> is an enthusiastic rock climber, scaling challenging peaks worldwide. Rock climbing represents their determination to conquer both Earth's heights and the cosmic challenges of space exploration. <lastname>'s military career took them to Chengdu, China, where they played a crucial role in the development of advanced aircraft. Chengdu's status as a hub for aerospace engineering and technology greatly influenced <lastname>'s approach to space missions, emphasizing precision and innovation in their work.",
			"Taikonaut <firstname> <lastname> is a prominent member of the Chinese space program, bringing their civilian expertise as a brilliant astrophysicist to cosmic missions. Outside the realm of space, <lastname> is an accomplished calligrapher, crafting intricate characters that embody the essence of Chinese culture. Their calligraphy, often displayed in space stations, symbolizes the fusion of tradition and exploration. Hailing from Sichuan Province, China, <lastname> draws inspiration from the province's rich culinary traditions. Sichuan's fiery cuisine mirrors the fiery passion <lastname> brings to unraveling the mysteries of the universe, infusing creativity into both their scientific pursuits and culinary delights.",
			"Taikonaut <firstname> <lastname> is celebrated for their contributions to the Chinese space program, with a civilian career as an environmental scientist. When not conducting experiments in space, <lastname> explores the world of traditional Chinese medicine, using herbs and natural remedies to promote health. Their holistic approach to well-being extends from Earth's healing traditions to the challenges of cosmic exploration. Born in Shandong Province, China, <lastname> is deeply rooted in the province's cultural heritage. Shandong's historical significance and contributions to philosophy have influenced <lastname>'s perspective on the harmony of nature and human endeavors, a philosophy they carry into their space missions.",
			"Commander <firstname> <lastname> is an esteemed taikonaut renowned for their expertise in space habitat design within the Chinese space program. Their civilian career as an architect has left an indelible mark on the design of spacecraft interiors. Beyond space, <lastname> is a dedicated martial artist, finding strength and discipline through ancient Chinese martial arts. Hailing from Zhejiang Province, China, <lastname> cherishes the province's natural beauty, known for its picturesque landscapes and vibrant tea culture. The tranquility of Zhejiang's tea plantations provides <lastname> with moments of reflection, aligning their love for space habitat design with the balance of Earth's ecosystems.",
			"Taikonaut <firstname> <lastname>, a visionary explorer within the Chinese space program, who embarked on cosmic journeys from a civilian background in robotics and artificial intelligence. Beyond their work in space, <lastname> is a prolific science fiction writer, crafting tales that delve into the future of technology and space exploration. Hailing from Hubei Province, China, <lastname> draws inspiration from the province's historical significance and technological advancements. The province's rich heritage has shaped <lastname>'s creative narratives and their vision for the future of humanity among the stars.",
			"Taikonaut <firstname> <lastname> is a dedicated member of the Chinese space program, bringing their civilian expertise as an environmental engineer to cosmic missions. Beyond their space endeavors, <lastname> is a passionate advocate for wildlife conservation, working tirelessly to protect China's natural ecosystems and endangered species. Born in Fujian Province, China, <lastname> is deeply connected to the province's coastal landscapes and maritime traditions. Fujian's diverse ecosystems and cultural heritage have influenced <lastname>'s commitment to preserving Earth's biodiversity, reflecting their dedication to responsible space exploration.",
			"Taikonaut <firstname> <lastname> is a prominent member of the Chinese space program, bringing their civilian expertise as a brilliant astrophysicist to cosmic missions. Outside the realm of space, <lastname> is an accomplished calligrapher, crafting intricate characters that embody the essence of Chinese culture. Their calligraphy, often displayed in space stations, symbolizes the fusion of tradition and exploration. Trained in the Gobi Desert, <lastname> draws inspiration from the stark beauty and solitude of this unique location. The desert's vast expanses mirror the boundless possibilities of cosmic exploration, infusing creativity into both their scientific pursuits and artistic expressions.",
			"Taikonaut <firstname> <lastname> is celebrated for their contributions to the Chinese space program, with a civilian career as an environmental scientist. When not conducting experiments in space, <lastname> explores the world of traditional Chinese medicine, using herbs and natural remedies to promote health. Their holistic approach to well-being extends from Earth's healing traditions to the challenges of cosmic exploration. Trained in the Tibetan Plateau, <lastname> developed a deep appreciation for the region's serene landscapes and ancient healing practices. The plateau's spiritual significance has influenced <lastname>'s perspective on the interplay between human health and the mysteries of the universe.",
			"Commander <firstname> <lastname> is an esteemed taikonaut renowned for their expertise in space habitat design within the Chinese space program. Their civilian career as an architect has left an indelible mark on the design of spacecraft interiors. Beyond space, <lastname> is a dedicated martial artist, finding strength and discipline through ancient Chinese martial arts. Trained in the Shaolin Temple, <lastname> embraces the temple's philosophy of balance and harmony in both physical and mental pursuits. This philosophy resonates with their approach to space habitat design, seeking the perfect blend of form and function for the well-being of future space travelers.",
			"Taikonaut <firstname> <lastname>, a visionary explorer within the Chinese space program, who embarked on cosmic journeys from a civilian background in robotics and artificial intelligence. Beyond their work in space, <lastname> is a prolific science fiction writer, crafting tales that delve into the future of technology and space exploration. Trained at the Qingdao Space Center, <lastname> draws inspiration from the cutting-edge technology and innovative spirit of this space training facility. Qingdao's reputation for pushing the boundaries of space exploration aligns with <lastname>'s vision for humanity's destiny among the stars.",
			"Taikonaut <firstname> <lastname> is a dedicated member of the Chinese space program, bringing their civilian expertise as an environmental engineer to cosmic missions. Beyond their space endeavors, <lastname> is a passionate advocate for wildlife conservation, working tirelessly to protect China's natural ecosystems and endangered species. Trained at the Jiuquan Satellite Launch Center, <lastname> developed a profound respect for the importance of preserving Earth's delicate balance. The center's remote location in the Gobi Desert heightened their awareness of the need for responsible space exploration, reflecting <lastname>'s commitment to safeguarding our planet's biodiversity.",
			"Taikonaut <firstname> <lastname> is a prominent member of the Chinese space program, known for their civilian expertise as a brilliant astrophysicist. Beyond their scientific pursuits, <lastname> is part of a distinguished Chinese family with a legacy in space exploration. They have continued their family's tradition of contributing to space research and development. Trained in the Gobi Desert, <lastname> draws inspiration from the vastness of this unique location. The desert's boundless horizons mirror the limitless potential of cosmic exploration, and their family's heritage fuels their dedication to pushing the boundaries of space science.",
			"Taikonaut <firstname> <lastname> is celebrated for their contributions to the Chinese space program, with a civilian career as an environmental scientist. Besides their space missions, <lastname> belongs to an influential Chinese family with deep connections to the nation's space endeavors. Their family's commitment to progress has been a driving force in their own journey into space. Trained in the Tibetan Plateau, <lastname> gained appreciation for the plateau's serene landscapes and ancient traditions. Their family's legacy of innovation resonates with their holistic approach to environmental science and cosmic exploration.",
			"Commander <firstname> <lastname> is an esteemed taikonaut renowned for their expertise in space habitat design within the Chinese space program. In addition to their architectural career, <lastname> hails from a distinguished Chinese family that has played a pivotal role in the nation's aerospace industry. They carry forward the legacy of excellence in their space endeavors. Trained at the Shaolin Temple, <lastname> embraces the temple's philosophy of balance and harmony, reflecting their family's dedication to the harmonious coexistence of design and function in space habitats.",
			"Taikonaut <firstname> <lastname>, a visionary explorer within the Chinese space program, who embarked on cosmic journeys from a civilian background in robotics and artificial intelligence. <lastname> is a member of a highly regarded Chinese family with a history of shaping the nation's technological landscape. They continue their family's tradition of pushing the boundaries of scientific and technological innovation. Trained at the Qingdao Space Center, <lastname> is inspired by the center's cutting-edge technology and innovative spirit. Their family's commitment to advancing science and space exploration aligns with their own vision for the future of humanity among the stars.",
			"Taikonaut <firstname> <lastname> is a dedicated member of the Chinese space program, known for their civilian expertise as an environmental engineer. Beyond their space endeavors, <lastname> belongs to a prominent Chinese family with a legacy of environmental stewardship and conservation efforts. Their family's commitment to preserving the planet influences their work in space, emphasizing the importance of responsible exploration. Trained at the Jiuquan Satellite Launch Center, <lastname> gained a deep respect for the role of technology in space exploration, reflecting their family's dedication to innovation. They carry the legacy of their family's dedication to safeguarding the Earth's ecosystems and biodiversity into their cosmic missions.",
			"Taikonaut <firstname> <lastname> is a prominent member of the Chinese space program, known for their civilian expertise as a brilliant astrophysicist. Beyond their scientific pursuits, <lastname> has been an active participant in various scientific committees, contributing their knowledge to the advancement of space exploration. Their commitment to space science aligns with their dedication to serving the nation.",
			"Taikonaut <firstname> <lastname> is celebrated for their contributions to the Chinese space program, with a civilian career as an environmental scientist. Beyond their space missions, <lastname> has been an advocate for environmental policies that promote sustainability and protect Earth's ecosystems. Their passion for environmental preservation resonates with the broader vision of the nation.",
			"Commander <firstname> <lastname> is an esteemed taikonaut renowned for their expertise in space habitat design within the Chinese space program. In addition to their architectural career, <lastname> has been involved in various governmental advisory roles related to space exploration. Their commitment to innovative space habitat design reflects their belief in the nation's potential for pioneering advancements.",
			"Taikonaut <firstname> <lastname>, a visionary explorer within the Chinese space program, who embarked on cosmic journeys from a civilian background in robotics and artificial intelligence. <lastname> has played a role in research initiatives supported by the nation's leading political party, contributing to the development of advanced robotics technology. Their work aligns with the broader goals of the party, aimed at technological progress and space exploration.",
			"Taikonaut <firstname> <lastname> is a dedicated member of the Chinese space program, known for their civilian expertise as an environmental engineer. Beyond their space endeavors, <lastname> has been involved in international collaborations that promote global sustainability, in line with the nation's foreign policy objectives. Their commitment to responsible space exploration echoes the values upheld by the nation on the global stage.",
			"Taikonaut <firstname> <lastname> is a distinguished member of the Chinese space program, bringing their civilian expertise as a brilliant astrophysicist to cosmic missions. Beyond their scientific pursuits, <lastname> is an accomplished musician, playing the erhu, a traditional Chinese string instrument. Their celestial melodies have resonated through the vastness of space, providing solace and creativity to fellow crew members during long missions. In addition to their musical talents, <lastname> is an avid mountaineer, conquering some of the world's highest peaks. The challenges of scaling mountains mirror the obstacles faced in space exploration, and <lastname>'s passion for adventure extends from Earth's peaks to the cosmic wonders beyond.",
			"Taikonaut <firstname> <lastname> is celebrated for their contributions to the Chinese space program, with a civilian career as an environmental scientist. When not conducting experiments in space, <lastname> explores the world of traditional Chinese medicine, using herbs and natural remedies to promote health. Their holistic approach to well-being extends from Earth's healing traditions to the challenges of cosmic exploration. In addition to their medical pursuits, <lastname> is an enthusiastic wildlife photographer, capturing the beauty of Earth's ecosystems. Their photographs serve as a reminder of the planet's biodiversity and the importance of responsible space exploration that safeguards these natural wonders.",
			"Commander <firstname> <lastname> is an esteemed taikonaut renowned for their expertise in space habitat design within the Chinese space program. Beyond their architectural career, <lastname> is a passionate advocate for sustainable living and practices what they preach by cultivating their own organic garden. Tending to the garden provides a sense of connection to Earth's ecosystems, even amidst the sterile environments of space habitats. In addition to their gardening, <lastname> is an avid collector of antique books, particularly those related to ancient Chinese philosophy. The wisdom of these ancient texts resonates with their approach to space habitat design, seeking to create harmonious and balanced living spaces for future space travelers.",
			"Taikonaut <firstname> <lastname>, a visionary explorer within the Chinese space program, who embarked on cosmic journeys from a civilian background in robotics and artificial intelligence. While their work in space often involves designing and operating advanced robots, <lastname>'s personal passion lies in woodworking. In their free time, they craft intricate wooden sculptures, a meticulous and patient hobby that provides a creative outlet distinct from the precision of their space job. Apart from woodworking, <lastname> is also an avid scuba diver. Exploring the depths of the ocean provides them with a sense of wonder and adventure that complements their fascination with the cosmos. Whether exploring space or the ocean's depths, <lastname> seeks to unravel the mysteries of the unknown.",
			"Taikonaut <firstname> <lastname> is a dedicated member of the Chinese space program, known for their civilian expertise as an environmental engineer. Beyond their space endeavors, <lastname> is an accomplished chef, specializing in traditional Chinese cuisine. They take pride in preparing exquisite dishes that reflect their cultural heritage, a source of comfort and connection to their roots amidst the challenges of space travel. In addition to their culinary talents, <lastname> is a passionate painter. They create vivid artworks inspired by the natural landscapes of China, capturing the beauty of the country's diverse geography. Painting serves as a deeply personal hobby that allows <lastname> to express their emotions and experiences, providing a colorful contrast to the sterile environments of space.",
			"Taikonaut <firstname> <lastname> is a distinguished scientist with a Ph.D. in Astrophysics, specializing in space phenomena and cosmic radiation. Recognized for their groundbreaking research and academic achievements, <lastname> embarked on a career as a Taikonaut in the Chinese space program. Their deep scientific knowledge enhances their contributions to space missions. Outside of their space endeavors, <lastname> is an accomplished landscape photographer, capturing the natural beauty of Earth's landscapes with a unique perspective.",
			"Taikonaut <firstname> <lastname> is a rising star in the Chinese space program, celebrated for their accomplishments in the field of Astrobiology. Holding a Ph.D. in this specialized area, <lastname> has conducted groundbreaking research on extremophiles and their potential relevance to extraterrestrial life. Their scientific curiosity and passion for space exploration led them to join the ranks of Taikonauts. Outside of their rigorous training, <lastname> is an avid amateur astronomer, spending their nights observing celestial wonders.",
			"Taikonaut <firstname> <lastname>, a dedicated scientist-astronaut in the Chinese space program. With advanced degrees in Space Engineering and a deep understanding of spacecraft systems, <lastname> plays a vital role in space missions. Their academic excellence in these fields positions them as a valuable asset to the program. During their leisure time, <lastname> finds solace in mountaineering, drawing parallels between the challenges of Earth's mountains and the mysteries of the cosmos, enhancing their contributions to space exploration.",
			"Taikonaut <firstname> <lastname> is a distinguished scientist with a Ph.D. in Astrophysics, specializing in space phenomena and cosmic radiation. Recognized for their groundbreaking research and academic achievements, <lastname> embarked on a career as a Taikonaut in the Chinese space program. Their deep scientific knowledge enhances their contributions to space missions. Outside of their space endeavors, <lastname> enjoys family time with their loving partner and two children, relishing in the simple joys of life.",
			"Taikonaut <firstname> <lastname> is a distinguished scientist with a Ph.D. in Astrophysics, specializing in space phenomena and cosmic radiation. Recognized for their groundbreaking research and academic achievements, <lastname> embarked on a career as a Taikonaut in the Chinese space program. Their deep scientific knowledge enhances their contributions to space missions. Outside of their space endeavors, <lastname> enjoys the tranquility of amateur astronomy and the adrenaline rush of skydiving, combining their love for the cosmos with a passion for freefall.",
			"Taikonaut <firstname> <lastname>, a dedicated scientist-astronaut in the Chinese space program. With advanced degrees in Space Engineering and a deep understanding of spacecraft systems, <lastname> plays a vital role in space missions. Their academic excellence in these fields positions them as a valuable asset to the program. During their leisure time, <lastname> finds solace in mountaineering and amateur astronomy, drawing parallels between the challenges of Earth's mountains and the mysteries of the cosmos, while maintaining a well-rounded life as a Taikonaut.",
			"Taikonaut <firstname> <lastname> is a rising star in the Chinese space program, celebrated for their accomplishments in the field of Astrobiology. Educated at Peking University, they conducted groundbreaking research on extremophiles and their potential relevance to extraterrestrial life. Their scientific curiosity and passion for space exploration led them to join the ranks of Taikonauts. Outside of their rigorous training and missions, <lastname> values the moments spent stargazing and exploring the underwater world through scuba diving, two hobbies that complement their journey in space science.",
			"Taikonaut <firstname> <lastname> is a distinguished scientist who honed their expertise at Tsinghua University in Beijing, renowned for their comprehensive research in the field of space science. With a deep passion for the cosmos, <lastname> embarked on a fulfilling career as a Taikonaut within the Chinese space program. Their academic journey equipped them with a profound understanding of space exploration, and they have contributed significantly to the success of numerous space missions. Outside of their space endeavors, <lastname> enjoys the tranquility of amateur astronomy, gazing at the stars and galaxies that have always fascinated them. Additionally, they seek an adrenaline rush through skydiving, a thrilling hobby that complements their daring spirit.",
			"Commander <firstname> <lastname> is an esteemed Taikonaut and a distinguished scientist who pursued their education at Zhejiang University, known for its rich history in engineering and technology. Their academic journey has equipped them with extensive knowledge of space weather and solar phenomena, which they actively apply in their role as a leader within the Chinese space program. Beyond their professional commitments, <lastname> is an enthusiast of scuba diving and underwater photography, using the mesmerizing underwater world as a source of inspiration and relaxation during their limited free time. They also enjoy playing the piano, finding solace and creative expression through music.",
			"Taikonaut <firstname> <lastname>, a dedicated scientist-astronaut in the Chinese space program who completed their education at Fudan University, a prestigious institution with a strong focus on science and engineering. Armed with a profound understanding of spacecraft systems, <lastname> plays a pivotal role in the execution of space missions. In their leisure time, they find solace in mountaineering, where the challenges of Earth's mountains mirror the mysteries of the cosmos that they aim to uncover. Additionally, <lastname> is an avid amateur astronomer, exploring the night sky and contemplating the wonders of the universe. They maintain a well-rounded life as a Taikonaut, contributing both scientifically and recreationally to the space program. In recent years, they've taken up pottery as a form of artistic expression, creating unique and intricate pieces of ceramic art during their downtime.",
			"Taikonaut <firstname> <lastname> is a renowned space scientist whose educational journey led them to Shanghai Jiao Tong University, known for its excellence in engineering and technology. Their academic prowess and dedication to space research have established them as a valuable asset to the Chinese space program. With a deep understanding of spacecraft systems, <lastname> plays a pivotal role in the success of various space missions. Beyond their professional life, <lastname> finds solace in rock climbing, conquering challenging heights that parallel the complexities of space exploration. They are also a skilled archer, finding focus and precision in the art of archery.",
			"Taikonaut <firstname> <lastname> is a rising star in the Chinese space program, celebrated for their accomplishments in the field of Astrobiology. Educated at Peking University, they conducted groundbreaking research on extremophiles and their potential relevance to extraterrestrial life. Their scientific curiosity and passion for space exploration led them to join the ranks of Taikonauts, where they continue to make significant contributions to space science. Outside of their rigorous training and missions, <lastname> values the moments spent stargazing and exploring the underwater world through scuba diving, two hobbies that complement their journey in space science. Additionally, they are an avid football player, finding camaraderie and teamwork on the football field.",
			" Taikonaut <firstname> <lastname>, a dedicated scientist-astronaut in the Chinese space program who completed their education at Fudan University, a prestigious institution with a strong focus on science and engineering. Armed with a profound understanding of spacecraft systems, <lastname> plays a pivotal role in the execution of space missions. In their leisure time, they find solace in mountaineering, where the challenges of Earth's mountains mirror the mysteries of the cosmos that they aim to uncover. Additionally, <lastname> is an avid amateur astronomer, exploring the night sky and contemplating the wonders of the universe. They maintain a well-rounded life as a Taikonaut, contributing both scientifically and recreationally to the space program. As an ardent basketball player, they enjoy friendly games with their peers, maintaining their physical fitness and competitive spirit through the sport.",
			"Taikonaut <firstname> <lastname> is a remarkable individual who hails from a humble background. Born into a poor family in a small village, <lastname> displayed an incredible talent for mathematics and engineering from a young age. Despite facing numerous challenges, they pursued their education with unwavering determination and earned a scholarship to a local university. With a degree in Aerospace Engineering and a passion for space exploration, <lastname> was selected for the Chinese space program. Outside of their rigorous training and missions, they find solace in playing the traditional Chinese instrument, the erhu, channeling their emotions and creativity through music.",
			"Taikonaut <firstname> <lastname> is a shining example of resilience and talent. Raised in a modest neighborhood, they showed an exceptional aptitude for physics and astronomy during their early years. Despite financial constraints, they pursued their education with a burning passion for the cosmos. Through hard work and dedication, <lastname> secured a spot in the Chinese space program, becoming an inspiration to many. In their rare moments of leisure, they enjoy practicing Tai Chi, finding balance and harmony in the ancient martial art.",
			"Commander <firstname> <lastname> emerged from a challenging upbringing in a disadvantaged community, where resources were scarce. However, their natural brilliance in mathematics and problem-solving caught the attention of mentors who recognized their potential. Through sheer determination, they earned a degree in Aerospace Engineering. Their extraordinary talent led them to become a respected leader in the Chinese space program. In their limited free time, <lastname> immerses themselves in calligraphy, finding peace and expression through the strokes of the brush.",
			"Taikonaut <firstname> <lastname> is a member of a renowned family with a legacy deeply rooted in aerospace engineering. Born into a family of space scientists and engineers, <lastname> was destined for greatness. With a rich family tradition in space exploration, they naturally gravitated toward a career in the Chinese space program. Building upon their family's legacy, <lastname> has excelled in the field of spacecraft design and operations. In their spare time, they continue to honor their heritage by collecting antique space-related artifacts and memorabilia.",
			"Taikonaut <firstname> <lastname> pursued their dreams of space exploration by studying Aerospace Engineering at a prestigious American university. Their educational journey broadened their horizons and deepened their knowledge of spacecraft systems. However, they felt the call of their homeland and returned to China to join the Chinese space program. <lastname> now stands as a dedicated Taikonaut, using their international experience to enhance China's space endeavors. In their rare moments of respite, they enjoy painting, using the canvas to express the beauty of the universe that has always fascinated them.",
			"Taikonaut <firstname> <lastname> earned their master's degree in Aerospace Engineering from the Massachusetts Institute of Technology (MIT), a renowned institution for space-related studies. While in the United States, they gained invaluable insights into spacecraft design and propulsion systems. However, a strong sense of national pride and a desire to advance China's space endeavors led them back to their homeland. Now a prominent figure in the Chinese space program, <lastname> continues to make significant contributions to space exploration. In their leisure hours, they find solace in traditional Chinese calligraphy, an art form that connects them to their cultural roots.",
			"Taikonaut <firstname> <lastname> pursued their bachelor's degree in Astronautical Engineering at the University of Texas at Austin, a renowned institution with a strong aerospace program. Their educational journey in the United States exposed them to the intricacies of space systems and deepened their passion for space exploration. They returned to China to become a dedicated Taikonaut, using their knowledge to advance the nation's space ambitions. In their limited free time, they enjoy hiking, exploring China's diverse landscapes, and connecting with nature."
		],
	},
	{
		"Name": "Russian",
		"PicturePath": "culture_pictures/russian.png",
		"NationalityWeights": {
			"Russia" : 150,
			"China" : 5,
			"Kazakhstan" : 5,
			"Serbia" : 3,
            "Slovenia" : 3,
            "Ukraine" : 3,
            "Czechia" : 3,
			"Estonia" : 3,
			"Israel" : 3,
			"Bosnia and Herzegovina" : 3,
			"Germany" : 3,
			"Poland" : 3,
			"Romania" : 3,
			"Latvia" : 3,
			"Georgia" : 3,
            "Belarus" : 3,
            "Bulgaria" : 3,
			"Finland" : 2,
			"Arabia" : 2,
			"Lithuania" : 2,
			"France" : 2,
            "Azerbaijan" : 2,
			"Moldova" : 2,
			"Slovakia" : 2,
			"Sweden" : 2,
			"Hungary" : 2,
			"Armenia" : 2,
			"Croatia" : 2,
			"Denmark" : 1,
            "Norway" : 1,
			"USA" : 1,
			"Turkey" : 1,
            "Portugal" : 1,
            "Greece" : 1,
            "Macedonia" : 1,
            "Netherlands" : 1,
            "Great Britain" : 1,
            "Italy" : 1,
            "Iceland" : 1,
            "Spain" : 1,
            "Austria" : 1,
            "Kosovo" : 1,
            "Albania" : 1,
            "Swiss" : 1,
            "Ireland" : 1,
            "Luxembourg" : 1,
            "Korea" : 1,
            "Belgium" : 1,
            "Japan" : 1,
            "Montenegro" : 1,
            "India" : 1,
            "Malta" : 1,
            "Vietnam" : 1
		},
		"SkinColorTypeWeights": {
			"Real" : 10,
			"Fair" : 20,
			"Dark" : 0,
			"Caucasian" : 20,
			"Indian" : 0,
			"BeautifulTouch" : 20,
			"Ebony" : 0,
			"NormalAndTan" : 20,
			"Natural" : 5,
			"Asian" : 5,
			"Black" : 0,
			"Kerbal" : 0
		},
		"SuitColor1": {
            "r": 150,
            "g": 150,
            "b": 150,
            "a": 255
		},
		"SuitColor2": {
            "r": 250,
            "g": 100,
            "b": 25,
            "a": 255
		},
		"Biographies": [
			"Cosmonaut <firstname> <lastname> is a distinguished member of the Russian space program, bringing their civilian expertise as a brilliant astrophysicist to cosmic missions. Beyond their scientific pursuits, <lastname> is an accomplished musician, playing the balalaika, a traditional Russian string instrument. Their celestial melodies have resonated through the vastness of space, providing solace and creativity to fellow crew members during long missions. In addition to their musical talents, <lastname> is an avid mountaineer, conquering some of the world's highest peaks. The challenges of scaling mountains mirror the obstacles faced in space exploration, and <lastname>'s passion for adventure extends from Earth's peaks to the cosmic wonders beyond.",
			"Cosmonaut <firstname> <lastname> is celebrated for their contributions to the Russian space program, with a civilian career as an environmental scientist. When not conducting experiments in space, <lastname> explores the world of traditional Russian herbal medicine, using herbs and natural remedies to promote health. Their holistic approach to well-being extends from Earth's healing traditions to the challenges of cosmic exploration. In addition to their medical pursuits, <lastname> is an enthusiastic wildlife photographer, capturing the beauty of Earth's ecosystems. Their photographs serve as a reminder of the planet's biodiversity and the importance of responsible space exploration that safeguards these natural wonders.",
			"Commander <firstname> <lastname> is an esteemed cosmonaut renowned for their expertise in space habitat design within the Russian space program. Beyond their architectural career, <lastname> is a passionate advocate for sustainable living and practices what they preach by cultivating their own organic garden. Tending to the garden provides a sense of connection to Earth's ecosystems, even amidst the sterile environments of space habitats. In addition to their gardening, <lastname> is an avid collector of antique books, particularly those related to Russian literature and philosophy. The wisdom of these ancient texts resonates with their approach to space habitat design, seeking to create harmonious and balanced living spaces for future space travelers.",
			"Cosmonaut <firstname> <lastname>, a visionary explorer within the Russian space program, who embarked on cosmic journeys from a civilian background in robotics and artificial intelligence. While their work in space often involves designing and operating advanced robots, <lastname>'s personal passion lies in woodworking. In their free time, they craft intricate wooden sculptures, a meticulous and patient hobby that provides a creative outlet distinct from the precision of their space job. Apart from woodworking, <lastname> is also an avid scuba diver. Exploring the depths of the ocean provides them with a sense of wonder and adventure that complements their fascination with the cosmos. Whether exploring space or the ocean's depths, <lastname> seeks to unravel the mysteries of the unknown.",
			"Cosmonaut <firstname> <lastname> is a dedicated member of the Russian space program, known for their civilian expertise as an environmental engineer. Beyond their space endeavors, <lastname> is an accomplished chef, specializing in traditional Russian cuisine. They take pride in preparing exquisite dishes that reflect their cultural heritage, a source of comfort and connection to their roots amidst the challenges of space travel. In addition to their culinary talents, <lastname> is a passionate painter. They create vivid artworks inspired by the natural landscapes of Russia, capturing the beauty of the country's diverse geography. Painting serves as a deeply personal hobby that allows <lastname> to express their emotions and experiences, providing a colorful contrast to the sterile environments of space.",
			"Cosmonaut <firstname> <lastname> is a distinguished member of the Russian space program, bringing their civilian expertise as a brilliant astrophysicist to cosmic missions. Beyond their scientific pursuits, <lastname> is a dedicated wildlife tracker, using their skills to identify and observe animal species in remote areas. Their ability to analyze terrestrial ecosystems informs their understanding of space habitats and the interplay between life forms and environments. In addition to wildlife tracking, <lastname> has a passion for abstract sculpture. They create intricate pieces inspired by the cosmos, shaping metals and materials to reflect the mysteries of space. Their sculptures evoke a sense of wonder and curiosity, much like the celestial wonders they explore professionally.",
			"Cosmonaut <firstname> <lastname> is celebrated for their contributions to the Russian space program, with a civilian career as an oceanographer. When not conducting experiments in space, <lastname> indulges in underwater archaeology, exploring submerged historical sites and shipwrecks. Their fascination with the secrets hidden beneath Earth's oceans complements their quest to unlock the mysteries of space. In addition to their underwater pursuits, <lastname> is a skilled beatboxer. They create intricate rhythms and sounds with their vocal talents, which serve as a unique form of entertainment and stress relief during long space missions.",
			"Commander <firstname> <lastname> is an esteemed cosmonaut renowned for their expertise in space habitat design within the Russian space program. Beyond their architectural career, <lastname> is a passionate advocate for sustainable living and practices what they preach by cultivating their own rooftop garden. Tending to the garden provides a sense of connection to Earth's ecosystems, even amidst the sterile environments of space habitats. In addition to gardening, <lastname> is an expert in origami, the Japanese art of paper folding. They create intricate and delicate origami sculptures, incorporating them into space habitat designs to add aesthetic and functional elements to living spaces.",
			"Cosmonaut <firstname> <lastname>, a visionary explorer within the Russian space program, who embarked on cosmic journeys from a civilian background in robotics and artificial intelligence. While their work in space often involves designing and operating advanced robots, <lastname> is an avid competitive chess player. They participate in international chess tournaments and even play chess against fellow crew members during space missions, challenging their strategic thinking in a zero-gravity environment. Apart from chess, <lastname> is a skilled glassblower. They craft intricate glass sculptures that are not only visually stunning but also serve functional purposes in space experiments, reflecting their dedication to blending art and science.",
			"Cosmonaut <firstname> <lastname> is a dedicated member of the Russian space program, known for their civilian expertise as an environmental engineer. Beyond their space endeavors, <lastname> is a passionate paraglider. They soar through the skies, experiencing the freedom of flight and observing Earth from unique perspectives. Paragliding allows <lastname> to connect with the Earth's atmosphere, providing a contrast to the controlled environments of space. In addition to paragliding, <lastname> is an avid blacksmith. They craft intricate metalwork, forging tools and decorative pieces during their free time. This hands-on hobby represents their love for craftsmanship and complements their engineering background, creating a harmonious blend of art and technology.",
			"Cosmonaut <firstname> <lastname> is a distinguished member of the Russian space program, specializing in astrophysics and cosmic research. Their journey into space was propelled by their passion for photography. <lastname> is an accomplished astrophotographer, capturing the beauty of celestial bodies from Earth and beyond. Their stunning images have graced scientific publications and inspired many to explore the cosmos. <lastname>'s training led them to the vast expanses of Siberia, where they conducted fieldwork to study the impact of extreme cold on space equipment. The harsh conditions of Siberia served as a testing ground for their commitment to understanding the challenges of space exploration.",
			"Cosmonaut <firstname> <lastname> is celebrated for their contributions to the Russian space program, with a civilian background in environmental science. Their fascination with extreme environments led them to become an avid cave diver. Exploring submerged caves and underground water systems on Earth prepared them for the isolation and harsh conditions of space travel. During their training, <lastname> conducted fieldwork in the Altai Mountains, a region known for its unique ecosystems. This experience shaped their approach to environmental engineering in space and deepened their appreciation for preserving Earth's natural wonders.",
			"Commander <firstname> <lastname> is an esteemed cosmonaut renowned for their expertise in space habitat design within the Russian space program. Beyond their architectural career, <lastname> is a dedicated marathon runner. They have completed numerous marathons, demonstrating endurance and determination that parallel the challenges of space exploration. As part of their training, <lastname> spent time in Kamchatka, a remote and volcanic region in the Russian Far East. Their fieldwork in this geologically active area allowed them to gain insights into the construction of resilient space habitats, designed to withstand cosmic hazards.",
			"Cosmonaut <firstname> <lastname>, a visionary explorer within the Russian space program, who embarked on cosmic journeys from a civilian background in robotics and artificial intelligence. Their unconventional hobby is medieval swordsmanship. <lastname> is a skilled practitioner of historical European martial arts, drawing inspiration from ancient manuscripts to recreate combat techniques from the past. During their training, <lastname> ventured to the vast tundra of Yamalo-Nenets Autonomous Okrug in Siberia. Here, they conducted experiments related to robotic operations in extreme cold, combining their expertise in robotics with the challenges of subarctic conditions.",
			"Cosmonaut <firstname> <lastname> is a dedicated member of the Russian space program, known for their civilian background in mechanical engineering. Their unconventional hobby is building and piloting remote-controlled model submarines. This hands-on hobby reflects their fascination with underwater exploration and the mechanics of underwater vehicles. As part of their training, <lastname> conducted fieldwork in the rugged terrain of the Caucasus Mountains. This mountainous region in southern Russia provided valuable insights into engineering solutions for traversing challenging landscapes, which they apply to their work in space habitat design and mechanical systems aboard spacecraft.",
			"Cosmonaut <firstname> <lastname> is a distinguished member of the Russian space program, specializing in astrophysics and cosmic research. Their passion for the cosmos is complemented by their love for classical music. <lastname> is an accomplished pianist, finding solace and inspiration in the melodies of great composers. Their performances, sometimes even in space, serve as a reminder of the beauty and harmony that transcends Earth and the cosmos. <lastname> is a member of an influential oligarch family known for their contributions to the nation's aerospace industry. Their family's legacy of innovation and dedication to space exploration has played a pivotal role in <lastname>'s own journey to the stars.",
			"Cosmonaut <firstname> <lastname> is celebrated for their contributions to the Russian space program, with a civilian background in environmental science. Their love for adventure and the great outdoors led them to become an expert rock climber. Scaling towering cliffs and conquering challenging peaks has instilled in <lastname> a sense of resilience and determination that they carry into space. <lastname> belongs to an influential oligarch family that has shaped Russia's energy sector. Their family's commitment to technological advancement mirrors <lastname>'s own dedication to environmental science and responsible space exploration.",
			"Commander <firstname> <lastname> is an esteemed cosmonaut renowned for their expertise in space habitat design within the Russian space program. Beyond their architectural career, <lastname> has an extraordinary talent for gourmet cooking. They are a renowned chef, known for creating exquisite dishes that elevate space cuisine to new heights. <lastname> is part of an influential oligarch family with interests in the arts and culture. Their family's patronage of the arts has provided <lastname> with a deep appreciation for aesthetics, which they incorporate into the design of space habitats.",
			"Cosmonaut <firstname> <lastname>, a visionary explorer within the Russian space program, who embarked on cosmic journeys from a civilian background in robotics and artificial intelligence. Their hobby is cultivating and tending to a vast collection of exotic plants. In space, <lastname> grows a miniature botanical garden, experimenting with plant life in microgravity. <lastname> is closely linked to an influential oligarch family known for their investments in technology and innovation. Their family's support has allowed <lastname> to pursue their passion for robotics and AI, contributing to advancements in space exploration.",
			"Cosmonaut <firstname> <lastname> is a dedicated member of the Russian space program, known for their civilian background in mechanical engineering. In their free time, <lastname> is an avid collector of antique watches, with a particular fascination for horology. Their collection includes rare timepieces from different eras, reflecting their appreciation for precision and craftsmanship. <lastname> is a member of a prominent oligarch family with interests in various industries, including aerospace. Their family's commitment to technological excellence aligns with <lastname>'s own passion for mechanical engineering and space technology.",
			"Cosmonaut <firstname> <lastname> is a distinguished member of the Russian space program, specializing in astrophysics and cosmic research. They are an accomplished photographer, capturing the beauty of celestial bodies both from Earth and the International Space Station (ISS). Their breathtaking images serve as a bridge between the wonders of space and the people on Earth. <lastname> has extensive experience in international collaboration on the ISS, working closely with astronauts from various nations to conduct scientific experiments that benefit humanity as a whole. Their dedication to fostering global cooperation in space exploration reflects their belief in the power of unity.",
			"Cosmonaut <firstname> <lastname> is celebrated for their contributions to the Russian space program, with a civilian background in environmental science. Their passion for environmental conservation extends to a unique hobby  they are an accomplished underwater archaeologist. They have participated in numerous underwater expeditions to uncover and preserve historical artifacts. With extensive experience in international cooperation aboard the ISS, <lastname> has worked with astronauts from around the world on a variety of scientific experiments. Their collaborative spirit and dedication to global space exploration have earned them respect and admiration on the international stage.",
			"Commander <firstname> <lastname> is an esteemed cosmonaut renowned for their expertise in space habitat design within the Russian space program. Beyond their architectural career, <lastname> is an enthusiastic sailor, navigating the world's oceans during their free time. Sailing offers <lastname> a sense of adventure and an opportunity to connect with the forces of nature. As a veteran of the ISS, <lastname> has extensive experience in international collaborations, conducting experiments and research alongside astronauts from different nations. Their leadership skills and commitment to teamwork have made them an invaluable asset in fostering international cooperation in space.",
			"Cosmonaut <firstname> <lastname>, a visionary explorer within the Russian space program, who embarked on cosmic journeys from a civilian background in robotics and artificial intelligence. Their unique hobby is competitive ballroom dancing. Despite the challenges of zero gravity, <lastname> has danced their way through the corridors of the ISS, bringing elegance and grace to the cosmos. <lastname> has a long history of international collaboration on the ISS, working closely with astronauts from various countries. Their ability to adapt and communicate effectively across language and cultural barriers has been essential in strengthening international bonds in space exploration.",
			"Cosmonaut <firstname> <lastname> is a dedicated member of the Russian space program, known for their civilian background in mechanical engineering. In their free time, <lastname> is an avid mountaineer, scaling some of the world's highest peaks. Their hobby is a testament to their determination and resilience, qualities that have served them well in the challenging environments of space. <lastname> has a wealth of international collaboration experience aboard the ISS, conducting experiments and research alongside astronauts from different nations. Their ability to collaborate seamlessly with colleagues from around the world has made them a key contributor to the success of international space missions.",
			"Cosmonaut <firstname> <lastname> is celebrated for their contributions to the Russian space program, with a civilian background in environmental science. They are an accomplished wildlife photographer, capturing the beauty of Earth's ecosystems and the creatures that inhabit them. Their photographs serve as a powerful reminder of the importance of environmental preservation. During their training, <lastname> spent time in the vast Siberian wilderness, conducting fieldwork to study the region's unique ecology. This experience informs their commitment to responsible space exploration and the protection of our planet.",
			"Commander <firstname> <lastname> is an esteemed cosmonaut renowned for their expertise in space habitat design within the Russian space program. Beyond their architectural career, <lastname> is a dedicated equestrian, finding solace in the company of horses. Their love for horses has taught them patience, discipline, and the importance of building strong partnerships. <lastname>'s training included time in the Altai Mountains, a region known for its stunning landscapes and challenging terrain. This exposure prepared them for the complexities of designing resilient space habitats, combining their architectural skills with a deep understanding of nature.",
			"Cosmonaut <firstname> <lastname>, a visionary explorer within the Russian space program, who embarked on cosmic journeys from a civilian background in robotics and artificial intelligence. Their unique hobby is glassblowing, crafting intricate glass sculptures that reflect their fascination with both art and technology. During their training, <lastname> conducted experiments in the Ural Mountains. This experience allowed them to gain insights into the interaction between technology and nature, a perspective they carry into their space missions.",
			"Cosmonaut <firstname> <lastname> is a dedicated member of the Russian space program, known for their civilian background in mechanical engineering. They have a passion for aviation and are a licensed pilot, flying small aircraft during their free time. Their hobby represents their love for precision engineering and the thrill of taking to the skies. <lastname>'s training included rigorous exercises in the Caucasus Mountains, a region characterized by its rugged terrain. This experience honed their physical fitness and problem-solving skills, essential qualities for space exploration.",
			"Cosmonaut <firstname> <lastname> is a distinguished member of the Russian space program, specializing in astrophysics and cosmic research. They have a deep passion for mountain climbing and have scaled some of the highest peaks in the world. Their love for adventure and exploration extends from Earth's highest summits to the vastness of space. <lastname>'s training took them to the rugged landscapes of Kazakhstan. The challenging terrain prepared them for the physical demands of space missions, instilling resilience and determination.",
			"Cosmonaut <firstname> <lastname> is celebrated for their contributions to the Russian space program, with a civilian background in environmental science. They are a passionate rock climber, conquering challenging peaks with a spirit of adventure. Their pursuit of new heights mirrors the courage and determination of their great-aunt, Valentina Tereshkova, the first woman in space. During their training, <lastname> ventured into the remote landscapes of Kamchatka, drawing parallels between the extreme environments of Earth and space. Their experiences have shaped their commitment to responsible space exploration.",
			"Cosmonaut <firstname> <lastname> is a distinguished member of the Russian space program, renowned for their civilian expertise in astrophysics. They share a historic bond with their great-uncle, the legendary cosmonaut Yuri Gagarin, who made history as the first human to journey into space. <lastname>'s dedication to space exploration is a family legacy. Beyond their cosmic pursuits, <lastname> is an accomplished painter, creating vibrant artworks inspired by the cosmos. Their art serves as a bridge between the realms of science and creativity, much like the legacy of their famous relative.",
			"Commander <firstname> <lastname> is an esteemed cosmonaut renowned for their expertise in space habitat design within the Russian space program. They are a dedicated sailor, navigating the world's oceans with precision and skill. Their love for the sea runs in the family, as they are the niece of Alexei Leonov, the first person to conduct a spacewalk. As part of their training, <lastname> explored the Arctic Circle, gaining insights into the challenges of extreme environments. This experience has influenced their approach to creating resilient space habitats.",
			"Cosmonaut <firstname> <lastname>, a visionary explorer within the Russian space program, who embarked on cosmic journeys from a civilian background in robotics and artificial intelligence. They are an accomplished chess player, participating in international tournaments. Their great-uncle, Anatoly Karpov, is a renowned chess grandmaster. During their training, <lastname> conducted experiments in the Ural Mountains, connecting their love for strategic thinking in chess with problem-solving in space robotics. They approach each mission with the precision and foresight of a chess master.",
			"Cosmonaut <firstname> <lastname> is a dedicated member of the Russian space program, known for their civilian background in mechanical engineering. They have a deep passion for aviation and are a licensed pilot, following in the footsteps of their father, a former cosmonaut. The legacy of space exploration runs strong in their family. Beyond their flying endeavors, <lastname> is an avid musician, playing the violin. They often bring their violin on space missions, creating ethereal music in the zero-gravity environment of the spacecraft. Music serves as a reminder of their family's dedication to the cosmos and the beauty of human achievement.",
			"Cosmonaut <firstname> <lastname> is a distinguished member of the Russian space program, specializing in astrophysics and cosmic research. They graduated from the renowned Moscow State University, where they honed their expertise in the mysteries of the universe. Beyond their scientific pursuits, <lastname> is an accomplished stargazer and amateur astronomer. Their passion for observing celestial bodies extends from their academic studies to the quiet nights in the cosmos, where they find solace under the canopy of stars.",
			"Cosmonaut <firstname> <lastname> is celebrated for their contributions to the Russian space program, with a background in environmental science. They are a graduate of the prestigious Saint Petersburg State University, known for its environmental research programs. In their free time, <lastname> is an avid botanist, fascinated by the diversity of plant life on Earth. They have a collection of rare and exotic plants, which they often tend to on long space missions, conducting experiments to understand how plants adapt to the unique conditions of space.",
			"Commander <firstname> <lastname> is an esteemed cosmonaut renowned for their expertise in space habitat design within the Russian space program. They completed their training at the famous Bauman Moscow State Technical University, known for its engineering excellence. <lastname> is a skilled violinist, having spent years perfecting their craft. They often play the violin in the tranquil moments of space missions, finding comfort in the music that bridges the gap between the harsh realities of space and the beauty of human creativity.",
			"Cosmonaut <firstname> <lastname>, a visionary explorer within the Russian space program, who embarked on cosmic journeys from a background in robotics and artificial intelligence. They are an alum of the renowned Novosibirsk State Technical University, where they developed their passion for cutting-edge technology. In their free time, <lastname> is a skilled woodworker, crafting intricate and functional objects from wood. Their woodworking skills have even been applied to creating custom tools and components for space missions, reflecting their dedication to craftsmanship.",
			"Cosmonaut <firstname> <lastname> is a dedicated member of the Russian space program, known for their background in mechanical engineering. They completed their studies at the illustrious Moscow Aviation Institute, where they acquired the knowledge and skills that would later prove invaluable in space. <lastname> is a passionate photographer, capturing the beauty of Earth from the vantage point of space. Their photographs serve as a visual diary of their cosmic journeys, providing a unique perspective of our planet's natural wonders and human achievements.",
			"Cosmonaut <firstname> <lastname> is a distinguished member of the Russian space program, specializing in astrophysics and cosmic research. They pursued their higher education abroad, earning a Ph.D. in astrophysics from a prestigious European university. Inspired by their time overseas, they returned home to join the Russian space program, bringing their international expertise. Beyond their scientific pursuits, <lastname> is an accomplished poet, composing verses that reflect the beauty and wonder of the cosmos. Their poetry has been published in both national and international journals, serving as a source of inspiration for fellow space enthusiasts.",
			"Cosmonaut <firstname> <lastname> is celebrated for their contributions to the Russian space program, with a background in environmental science. They completed their undergraduate studies in the United States, where they developed a global perspective on environmental issues. They returned to Russia to apply their knowledge to space exploration. In their free time, <lastname> is an avid surfer, riding the waves wherever they find themselves on Earth. Their passion for surfing is a symbol of their connection to the forces of nature, whether on Earth's oceans or in the depths of space.",
			"Commander <firstname> <lastname> is an esteemed cosmonaut renowned for their expertise in space habitat design within the Russian space program. They pursued their architectural studies in Japan, gaining insights into innovative design concepts. They brought their unique blend of international design and Russian engineering back home to shape the future of space habitats. <lastname> is an enthusiastic gardener, cultivating a variety of plants in their backyard. Their green thumb extends to space, where they conduct experiments to understand how plants can thrive in the challenging conditions of cosmic environments.",
			"Cosmonaut <firstname> <lastname>, a visionary explorer within the Russian space program, who embarked on cosmic journeys after completing their mechanical engineering degree in Canada. Their international education exposed them to cutting-edge technology and innovation, which they apply to their work in space robotics. In their free time, <lastname> is a skilled mountaineer, scaling peaks around the world. Their passion for climbing serves as a symbol of their determination and resilience, qualities that have taken them to new heights in space exploration.",
			"Cosmonaut <firstname> <lastname> is a dedicated member of the Russian space program, known for their background in aerospace engineering. They pursued advanced studies in France, specializing in space propulsion systems. Their return home marked the beginning of a fruitful career in Russian space exploration. <lastname> is an avid painter, creating vibrant artworks inspired by the cosmos. Their artistic endeavors provide a creative outlet and a means to express the beauty of space, transcending the boundaries of language and science.",
			"Cosmonaut <firstname> <lastname> is a distinguished member of the Russian space program, celebrated for their achievements as a world-class violinist. Their virtuoso performances on Earth captivated audiences globally, and their unique talent earned them an invitation to join the space program. As a musician in space, <lastname> continues to captivate audiences, playing ethereal melodies in the cosmic silence. Beyond their musical prowess, <lastname> is an avid collector of antique musical instruments. They have amassed a remarkable collection, some of which have made the journey with them into the cosmos.",
			"Cosmonaut <firstname> <lastname> is celebrated for their contributions to the Russian space program, initially becoming famous as an award-winning author. Their novels captured the imaginations of readers worldwide, making them a literary sensation. Their literary prowess led to an invitation to join the space program, where they now document their cosmic experiences through the written word. In their free time aboard the spacecraft, <lastname> continues to write, crafting stories that merge the realms of science fiction and reality. Their unique perspective as both an author and cosmonaut offers a profound insight into the human experience beyond Earth.",
			"Commander <firstname> <lastname> is an esteemed cosmonaut renowned for their achievements as a celebrated painter. Their artistic talent brought them international acclaim, with their works displayed in prestigious galleries worldwide. It was their unique ability to capture the beauty of space on canvas that led to their admittance to the Russian space program. <lastname> continues to paint while in space, using specially designed tools and techniques to create otherworldly masterpieces. Their artistry offers a new way to convey the cosmic wonders they witness during their missions.",
			"Cosmonaut <firstname> <lastname>, a visionary explorer within the Russian space program, who achieved fame as a world-record-holding athlete. Their prowess in extreme sports captured the attention of millions, and their journey to space was a testament to the human body's potential. As a cosmonaut, <lastname> continues to push the boundaries of physical endurance and exploration. In their free time aboard the spacecraft, <lastname> maintains their athletic routine, using specially designed equipment to stay in peak physical condition. Their dedication to fitness serves as an inspiration to aspiring cosmonauts and athletes alike.",
			"Cosmonaut <firstname> <lastname> is a dedicated member of the Russian space program, known for their fame as an acclaimed chef. Their culinary talents delighted palates around the world, earning them Michelin stars and culinary awards. An invitation to join the space program was extended in recognition of their ability to create gastronomic delights even in the challenging environment of space. <lastname> continues to experiment with space cuisine, crafting dishes that are as visually stunning as they are delicious. Their culinary creations add a touch of gourmet elegance to cosmic dining."
		],
	}
]